[{"url":".","title":"index","tags":["homepage"],"text":""},{"url":"search/","title":"Search results","tags":[],"text":"window.init_search();SearchResults\nLoading..."},{"url":"assets/scripts/get_highlights/","title":"get_highlights","tags":[],"text":"if isempty get metadata \"homepage\" , \"highlights\", nothing else highlights htl \"\"\" section div class \"content\" h2 x \"name\" h2 p x \"text\" p div div class \"preview\" img src \" x \"img\" \" div section \"\"\" for x in metadata \"homepage\" \"highlights\" htl \"\"\" div class \"subjectscontainer wide\" h1 Highlights h1 div class \"contain\" highlights div div \"\"\" end"},{"url":"assets/scripts/get_subjects/","title":"get_subjects","tags":[],"text":"let sections metadata \"sidebar\" sections htl \"\"\" let input other page.input output other page.output name get output.frontmatter, \"title\", basename input.relative path desc get output.frontmatter, \"description\", nothing tags get output.frontmatter, \"tags\", String image get output.frontmatter, \"image\", nothing class \"no decoration\", \"tag replace x, \" \" \" \" \" for x in tags ..., image nothing || isempty image ? nothing htl \"\"\" a title desc class class href root url \" \" other page.url h3 name h3 img src image a \"\"\" end for other page in collections section id .pages \"\"\" for section id, section name in sections isempty sections ? nothing htl \"\"\" div class \"wide subjectscontainer\" h1 Subjects h1 div class \"subjects\" sections div div \"\"\" end"},{"url":"cheat_sheets/catalyst/","title":"Catalyst","tags":["cheat sheets"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"3\" title \"Catalyst\" date \"2025 01 26\" tags \"cheat sheets\" description \"Catalyst Cheat Sheet\" layout \"layout.jlhtml\" frontmatter.author name \"Daan Van Hauwermeiren\" frontmatter.author name \"Michiel Stock\" using Markdown using InteractiveUtils using Pkg Pkg.activate \".. .. pluto deployment environment\" using Catalyst, Plots, DifferentialEquations md\"\"\" Notes before the cheat sheet In Pluto, there can only be one statement per cell because of the syntax tree that is generated to determine the order of execution . But sometimes we want to group multiple expressions for clarity. We can do that in two ways, using the same syntax, but with a different keyword both call for wrapping the code in a block. The first one is for simply wrapping multiple statements the variable names can be accessed in the rest of the notebook ```julia begin ... end ``` In the second one, the variables only live within the scope of the block. We will use this to illustrate behaviour, but we do not need the rest in any other part of the notebook, and we want to avoid having to add numerous postfixes to the variable names. ```julia let ... end ``` Note that the indentation is optional, and only used for readability. \"\"\" md\" `Catalyst` cheat sheet\" md\"\"\" `Catalyst.jl` is a Julia package that provides a clean interface to building reaction networks, which can be turned into ODESystems that `DifferentialEquations.jl` can simulate. Since almost all mass transfer problems can be written using reactions or, more generally speaking, processes , `Catalyst.jl` will be our main tool for building mechanistic models. \"\"\" md\" Defining a reaction system\" md\"\"\" Use the ` reaction network` macro to define a reaction network. This macro allows you to specify reactions using a simple syntax. \"\"\" mm reaction network begin kB, kD , S E ES reversible binding kP, ES P E conversion of substrate by enzyme end species mm check the species states parameters mm check the parameters equations mm check the equations let unpack S mm extract parameter variable end osys convert ODESystem, mm convert ReactionSystem in an ODE system md\"\"\" It is also possible to add reactions using functions, such as building big reaction networks using code. For this, we refer to the documentations. \"\"\" md\" Simulation\" md\"\"\" Simulation of a reaction network builds upon DifferentialEquations.jl. Reaction networks can directly be transformed in ODE systems if you want to see the differential equations or a problem needed to solve numerically . \"\"\" u0map S 10.0, E 0.1, P 0.0, ES 0 define intial values pmap kB 0.5, kD 0.1, kP 2.2 define parameters let alternative, just as good u0map mm.S 10.0, mm.E 0.1, mm.P 0.0, mm.ES 0 pmap mm.kB 0.5, mm.kD 0.1, mm.kP 2.2 end tspan 0.0, 100. oprob ODEProblem mm, u0map, tspan, pmap sol solve oprob, Tsit5 plot sol plot all variables plot sol, idxs S, P plot only S and P begin alternative, unpack variables unpack P, S mm extract product and substrate plot sol, idxs P, S end plot sol, idxs P S P , title \"Fraction of substrate converted\" md\"\"\" You see that reaction systems have access to the variables and parameters, which are also used for plotting. \"\"\" md\" Using default options\" md\"You can already specify initial values and parameters directly in the reaction network.\" mm defaults reaction network begin species S t 10. E t 0.1 P t 0 ES t 0 parameters kB 0.5 kD 0.1 kP 2.2 kB, kD , S E ES kP, ES P E end oprob defaults ODEProblem mm defaults, , tspan no need to specify initial states and parameters plot solve oprob defaults, Tsit5 ODEProblem mm defaults, E 0.2 , tspan, kP 1.5 overwriting defaults mm ann reaction network begin species S t 10. description \"substrate\" P t 0 description \"product\" parameters kB 0.5 description \"binding rate\" kD 0.1 description \"dissociated rate rate\" kP 2.2 description \"conversion rate\" kB, kD , S E ES kP, ES P E end adding annotation to the parameters md\" Observables\" md\"\"\" Often, we are interested in the states or species in the system. However, sometimes we want to track something that is not a state but computed based on the states. This is an observable. Even though you can always compute these afterward, adding them to the system is likely useful so you have access to them while plotting. Consider the total amount of enzyme in the system. It is clear that this is conserved. \"\"\" mm obs reaction network begin observables begin Etot ~ E ES end kB, kD , S E ES kP, ES P E end observed mm obs oprob obs ODEProblem mm obs, u0map, tspan, pmap sol obs solve oprob obs, Tsit5 plot sol obs, idxs Etot, ylims 0,1 flat line, enzyme is conserved md\" Removing conserved quantities\" equations osys mm conserved convert ODESystem, mm, remove conserved true equations mm conserved enzyme E ES is conserved observed mm conserved still in observables md\" Events\" md\"\"\" Events are external perturbations of the system, either by changing the states or the parameters. There are two types of events discrete events which happen at fixed time points continuous events which happen when a variable reaches a certain value. \"\"\" md\" Discrete Events time based \" dilluting 20.0 mm.E ~ mm.E 2, mm.S ~ mm.S 2, mm.ES ~ mm.ES 2, mm.P ~ mm.P 2 at t 20, we double the volume of the reactor, hence halving the concentration named mm dil ReactionSystem equations mm , discrete events dilluting mm dillute complete mm dil oprob dil ODEProblem mm dillute, u0map, tspan, pmap sol dil solve oprob dil, Tsit5 , tstops 20 plot sol dil md\" Continuous events\" substrate feeding mm.S ~ 5 mm.S ~ mm.S 5 when the substrate reaches a concentration of 5, we add new substrate named mm f ReactionSystem equations mm , continuous events substrate feeding mm fed complete mm f oprob fed ODEProblem mm fed, u0map, tspan, pmap sol fed solve oprob fed, Tsit5 , tstops 20 plot sol fed md\" Computing steady state\" md\"It is possible to numerically compute when the system reaches a steady state.\" mm continuous reaction network begin kB, kD , S E ES reversible binding kP, ES P E conversion of substrate by enzyme 1, 0 S constant inflow 1, S, P 0 constant outflow end ssprob SteadyStateProblem mm continuous, u0map, pmap print solve ssprob md\" Discrete jump equations\" md\"\"\" When modelling discrete systems, we can turn the problem into a discrete jump equation. Here, the species are described by an integer there are a discrete number of molecules. This simulation is now stochastic. \"\"\" u0map int S 500, E 5, P 0, ES 0 starting with 500 substrate molecules and 5 enzyme molecules jsys JumpInputs mm, u0map int, tspan, pmap jprob JumpProblem jsys jsol solve jprob plot jsol md\" Stochastic Differential Equations\" md\"\"\" We can also simulate a reaction system as an SDE. Be wary that no mechanism prevents concentrations from being zero \"\"\" let sys reaction network begin k1, k2 , A B end u0map A 10., B 200. pmap k1 2, k2 5 sprob SDEProblem sys, u0map, 0., 20. , pmap sol solve sprob, STrapezoid , dt 0.02 plot sol end let sys reaction network begin parameters η default noise scaling η k1, k2 , A B end pmap k1 2, k2 5, η 0.1 u0map A 10., B 200. sprob SDEProblem sys, u0map, 0., 20. , pmap sol solve sprob, STrapezoid , dt 0.02 plot sol end let sys reaction network begin parameters η default noise scaling η k1, A B, noise scaling 0.0 k2, B A, noise scaling η end pmap k1 2, k2 5, η 1 u0map A 10., B 200. sprob SDEProblem sys, u0map, 0., 20. , pmap sol solve sprob, STrapezoid , dt 0.02 plot sol end "},{"url":"cheat_sheets/cheatsheets/","title":"Overview","tags":["cheat sheets"],"text":"Overview Cheat SheetsGetting Started with Julia - live.Fastrack to Julia cheatsheet.MATLAB-Julia-Python comparative cheatsheet by QuantEcon groupPlots.jl cheatsheet"},{"url":"cheat_sheets/intro_to_julia/","title":"Intro to Julia","tags":["cheat sheets"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"2\" title \"Intro to Julia\" date \"2025 01 28\" tags \"cheat sheets\" description \"General introduction to Julia\" layout \"layout.jlhtml\" frontmatter.author name \"Daan Van Hauwermeiren\" frontmatter.author name \"Michiel Stock\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element format off quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end format on end begin using Pkg Pkg.activate \".. .. pluto deployment environment\" using PlutoUI, Markdown TableOfContents end using LinearAlgebra using Statistics using Plots md\"\"\" Notebook 1 Getting up and running First of all, welcome to the course We hope you enjoy the ride. \"\"\" md\"\"\" 0. Welcome to Pluto We will do our exercises in the Pluto notebook environment. The Pluto notebooks are pure Julia alternatives to the Jupyter notebooks you might have worked with. They are fast and reactive and come equipped with their own package manager, making it easy to distribute them. Cells are immediately executed in order of their dependencies , so not in the order that they appear. This can be confusing at first. \"\"\" one 2 change me and everything is updated two one 2 I depend on one, so I am executed second three two one I am executed last md\"To run a cell either press on the ▶ symbol or press `shift ENTER`.\" Hi there, you are not supposed to see me md\"Press on the little 👁️ left of the cell to toggle a hidden cell.\" md\"You can only have one statement per line and all your variables need to have unique names. You can split statements in two lines or wrap them in a `begin ... end` block.\" a 2 a 7 md\"Pluto might seem strange at first, though its restrictions make it very flexible and allows to easily create interactivity \" md\"period bind period Slider 0.0 0.2 5, default 1, show value true \" mycos t cos period t plot mycos, 0, 8, xlab \"t\", title \"Cos period t \" md\"\"\" 1. The basics From zero to newbie. \"\"\" md\"\"\" Let's get started with the basics. Some mathematical operations, \"\"\" 1 2 adding integers 1.0 2.0 adding floats 1 2.0 adding a float to an integer... 2 4 standard division div 2, 4 Computes 2 4 truncated to an integer 2 ÷ 4 looks nicer but does exactly the same 2^8 raising to a power 7 % 3 get the remainder of the integer division 35 \\ 7 inverse division 1 3 fractions, gives the result as a rational 1 2 1 4 2.0 3.0im complex numbers 'c' characters unicode symbol symbols, we will use this for parameters ζ any LaTeX symbol 🎉 or Unicode emoji md\"variable assignment\" x 2 md\"In the Pluto notebook environment you are currently working in, it is not possible to define the same variable in two cells. However, this is not standard Julia behaviour. You can see that redefining a variable is possible,\" begin variable1 2.0 variable1 4.0 end variable1 md\"\"\" ```julia begin statement1 statement2 end ``` Enable to wrap multiple statements, since only single line statements are allowed in this notebook environment. \"\"\" md\"Similarly, `let ... end` blocks allow you to define a separate envirionment. Everything you define in such a block is only available there.\" let myprivatevar 3.0 end myprivatevar only available in the block τ 1 37 unicode variable names are allowed md\"\"\" unicode In most Julia editing environments, unicode math symbols can be typed when starting with a '\\' and hitting ' TAB '. \"\"\" md\"\"\" Unsure what the LaTeX name for a symbol is or how to type an emoiji? Just copy paste it in the REPL with a `?` at the beginning, e.g., `?ζ` and it will tell you how to type it.\"\"\" type \\alpha and TAB md\"Operators are not needed for multiplication.\" 5x This works md\"But strings are quite essential,\" mystery \"life, the universe and everything\" md\"and string interpolation is performed with ` `.\" \"The answer to mystery is 3 2 7 \" md\"\"\" Printing can be done with `println `. These Pluto notebooks distinguish the value of the evaluation or computation from what is printed. The latter is shown in a terminal. \"\"\" println \"The answer to mystery is 3 2 7 \" md\"\"\" repetitions of strings can be done using the operators ` ` and `^`. This use of ` ` and `^` makes sense by analogy with multiplication and exponentiation. Just as `4^3` is equivalent to `4 4 4`, we expect `\"Spam\"^3` to be the same as `\"Spam\" \"Spam\" \"Spam\"`, and it is. \"\"\" breakfast \"eggs\" abetterbreakfast \"SPAM\" breakfast abetterbreakfast breakfast abetterbreakfast^3 breakfast md\"\"\" Lots of handy `String` operations are available in the standard library of Julia \"\"\" md\"Unlike `Strings`, a `Char` value represents a single character and is surrounded by single quotes.\" 'x' md\"Similarly to Matlab, when using the REPL, Julia will print the result of every statement by default. To suppress this behaviour, just end the statement with a semicolon.\" var1 10 not printed... var1 ...but still defined var2 20 md\"\"\" 2. Logical statements From zero to one. \"\"\" md\"\"\" Boolean operators Julia uses `true` and `false` for Boolean variables. \"\"\" I💖Julia true true false 1 1 2 1 1 1 2 1 1 10 1 10 2 2 or 2 ≤ 2 \\le TAB 2 2 or 2 ≥ 2 \\ge TAB Comparisons can be chained 1 2 3 2 3 2 Logical operators true && true true || false md\"Likewise, we have the Boolean logic operators `&&` AND , `||` OR and `⊻` XOR, exclusive or .\" true && true true && false true || false false || false true ⊻ false true ⊻ true md\"\"\" Chaining logic operators is frequently done in Julia as a short alternative for an `if` statement. The idea is if you use an `&&` statement, the second part is only evaluated if the first part is true The inverse is true for `||`, where the second part is only evaluated if the first part is false.\"\"\" md\"\"\" 3. Vectors and matrices Julia has powerful, flexible interfaces for vectors, matrices, and higher order tensors. A vector is defined with square brackets with the elements separated with a \",\" \"\"\" v 1, 3, 2 a vector of integers v2 1.0, 2.0, 3.0 a vector of floats v3 1.0, 2, 3 promotion occurs automatically to the most general type md\"Matrices can also be defined with spaces to separate elements in rows and semicolumns to separate rows.\" A 5 4 9 1 2 7 8 6 3 md\"You can use spaces and brackets to combine matrices and vectors \" A v 0 1 2 3 md\"Indexing is via square brackets like python and the index starts from 1 like in Matlab and R .\" v 1 first element v 0 does not exist... v end last element A 2,3 two indices for matrices A 1, first row A ,2 second column A A. 5 conditional indexing, notice the \".\" md\"Many functions exist that process collections.\" sum A size A sum A, dims 1 sum over the rows sort v size v length v count isodd, A count the number of odd elements in A sum sqrt, A sum ii √A ij md\"Many more advanced functions are available, for example linear algebra \" det A norm v eigen A mean A std v md\"Finally, there will be useful range objects, that define a linear range between begin and end values.\" 1 100 from 1 to 100 0 0.1 1 from 0 to 1 in steps of 0.1 md\"These work just like vectors.\" myrange 10 0.2 809 myrange 87 sum myrange length myrange md\"\"\" 4. Functions Julia puts the fun in functions. User defined functions can be declared as follows, \"\"\" function square x result x x return result end square 8 md\"Many of the functions we will need will be fairly simple equations. We can just define them in one line. A more condensed version of `square x `.\" s x x x s 8 md\"\"\" Functions are first class and work just like any other variable For example, you can give a function as an input in another function. In some cases, you might want to define an anonymous function , without giving them a name \"\"\" anfun x x^2 2x 8 md\"This looks like a variable but can be used as a function \" anfun 1.5 works just like any function md\"Why do we need this? Because we might want to define small functions on the fly.\" count x 4 x^2 80, 100 100 count the numbers between 100 and 100, for which their square is between 4 and 80 md\"\"\" Complete the function `clip x `, which returns `x` if 0\\le x \\le 1 , `0` if x 0 and `1` if x 1 . \"\"\" clip x missing md\"By default, a function is over the whole object. Using a `.`, you can use the function element wise.\" square A A A square. A each element squared square v square does not work for vectors square. v element wise works exp A matrix exponential exp. A element wise exponential A 1 won' t work A . 1 add 1 to each element of A md\" 5. Control flow\" md\"The `if`, `else`, `elseif` statement is instrumental to any programming language. Note that control flow is ended with an `end` statement. In constrast to Python, tabs are only for clarity but do not impact functionality.\" if 4 3 'A' elseif 3 4 'B' else 'C' end md\" 6. Looping Looping using a `for` loop can be done by iterating over a list or range. Don't forget to end with an `end` at the end. \" for i in 1 10 println \" i squared s i \" end characters \"Harry\", \"Ron\", \"Hermione\" begin for char in characters println \"Character char\" end end md\"We can use `enumerate` to generate an iterator of tuples containing the index and the values of an iterator.\" begin for i, char in enumerate characters println \" i. char\" end end pets \"Hedwig\", \"Pig\", \"Crookshanks\" md\"`zip` binds two or more iterators and yields tuples of the pairs.\" begin for char, pet in zip characters, pets println \" char has pet as a pet\" end end md\" 7. Macros Macros provide a method to include generated code in the final body of a program. It is a way of generating a new output expression, given an unevaluated input expression. When your Julia program runs, it first parses and evaluates the macro, and the processed code produced by the macro is eventually evaluated like an ordinary expression. Some nifty basic macros are ` time` and ` show`. ` time` prints the cpu time and memory allocations of an expression.\" time square 10 md\"\"\"The ` show` macro is often useful for debugging purposes. It displays both the expression to be evaluated and its result, finally returning the value of the result.\"\"\" show 1 1 md\"Macro's will be vital in the domain specific languages we use in this course. Remember, when you see an ` `, some code is changed into other code.\" md\"\"\" 8. Plotting Quite essential for scientific programming is the visualisation of the results. `Plots` is the Julia package that handles a lot of the visualisation. `rand 10 ` returns an array of 10 random floats between 0 and 1. \"\"\" plot rand 10 md\"\"\"When loading in a package for the first time Julia will have to precompile this package, hence this step can take some time.\"\"\" begin plot 1 10, rand 10 , label \"first\" plot 1 10, rand 10 , label \"second\" adding to current figure using plot scatter 1 10 , randn 10 , label \"scatter\" xlabel \"x\" ylabel \"f x \" title \"My pretty Julia plot\" end plot 0 0.1 10, x sin x x, xlabel \"x\", ylabel \"sin x x\", color red, marker square, legend none notice the use of a symbol as an argument contour 5 0.1 5, 10 0.1 10, x, y 3x^2 4y^2 x y 6 md\"You can also directly plot functions \" plot sin, 0, 2pi md\"Don't worry about making a tidy plot. For many objects solutions of differential equations , the function `plot ` is overloaded, so we only have to `plot sol ` for a pretty plot. More to follow \" md\"\"\" Exercise Stirling's approximation for factorials The factorial function, \\displaystyle n 1\\cdot 2\\cdot 3\\cdots n 2 \\cdot n 1 \\cdot n, is often used in combinatorics but also other mathematical areas. Especially for large numbers it can get quite inefficient to compute. Stirling's approximation is an approximation for factorials, \\displaystyle n \\sim \\sqrt 2\\pi n \\left \\frac n e \\right ^ n , Complete the function `stirling ` by implementing Stirling's approximation. \"\"\" stirling n missing md\"You can add your approximation to the plot below.\" scatter 1 10, factorial. 1 10 , xlab \"n\", label \"n \", yscale log10 begin Do NOT delete this cell hint text Markdown.MD Markdown.Admonition \"hint\", \"Hint\", text almost text Markdown.MD Markdown.Admonition \"warning\", \"Almost there \", text keep working text md\"The answer is not quite right.\" Markdown.MD Markdown.Admonition \"danger\", \"Keep working on it \", text correct text md\"Great You got the right answer Let's move on to the next section.\" Markdown.MD Markdown.Admonition \"correct\", \"Got it \", text sol stirling n √ 2π n n exp 1 ^n md\"\" Only the last evaluation is shown. end hint md\"Check out `min`and `max`.\" if ismissing clip 0.1 if clip 1 0 && clip 0.25 ≈ 0.25 && clip 3.6 ≈ 1 correct else keep working end end if ismissing stirling 5 if sol stirling 20 ≈ stirling 20 correct else keep working end end "},{"url":"cheat_sheets/turing/","title":"Turing Cheat Sheet","tags":["cheat sheets"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"4\" title \"Turing Cheat Sheet\" date \"2025 01 29\" tags \"cheat sheets\" description \"Turing Cheat Sheet\" layout \"layout.jlhtml\" frontmatter.author name \"Bram Spanoghe\" frontmatter.author name \"Michiel Stock\" using Markdown using InteractiveUtils using Pkg Pkg.activate \".. .. pluto deployment environment\" using Distributions using Turing using StatsPlots md\" `Turing` cheatsheet\" md\" Distributions.jl\" distr LogNormal 2.0, 1.0 Define a LogNormal distribution with mean 2.0 and standard deviation 1.0 md\" Basic statistics\" mean distr Calculate the mean of the distribution var distr Calculate the variance std distr Calculate the standard deviation quantile distr, 0.25, 0.5, 0.75 Calculate the quartiles md\" Evaluate probability density and cumulative probability\" pdf distr, 2.0 Probability density at x 2.0 cdf distr, 5.0 Probability that a random variable is less than 5.0 md\" Sampling random values\" rand distr Draw a single random sample mysample rand distr, 1000 Generate 1000 random samples md\" Calculate statistics from samples\" mean mysample Approximate the mean using the sample std mysample Approximate the standard deviation md\" Calculate probabilities using samples\" mean x x^2 5, mysample P X^2 5 Method 1 Anonymous function and mean mean mysample.^2 . 5 P X^2 5 Method 2 Boolean operations filtered sample filter x x^2 5, mysample P X^2 5 Method 3 Filtering length filtered sample length mysample md\" Other calculations with samples\" mean sin, mysample Approximate E sin X using the sample more efficient mean sin. mysample Same md\" Turing.jl\" model function mymodel x ~ Exponential 2.0 Exponential prior for x y ~ Truncated Normal 1., x , 0.0, 10.0 Truncated Normal for y, dependent on x z ~ Poisson y Poisson distribution for z, dependent on y return z^2 y computed result optional end md\" Sampling\" xyzmodel mymodel Build the sampling model xyz rand xyzmodel Generate a single sample x, y, z xyz x , xyz y , xyz z Extract the individual variables mysamples rand xyzmodel for i in 1 1000 Generate 1000 samples xyzmodel random sample of the result z^2 y md\" Calculate probabilities using samples \" mean xyz xyz z 0, mysamples P Z 0 Method 1 Anonymous function and mean length filter xyz xyz z 0, mysamples length mysamples P Z 0 Method 2 Filtering mean rand xyzmodel z 0 for i in 1 1000 P Z 0 Method 3 Boolean Operations on samples mean xyz xyz z 0, filter xyz xyz x 1, mysamples P Z 0 | x 1 Method 1 Filtering and mean mean xyz z 0 for xyz in mysamples if xyz x 1 P Z 0 | x 1 Method 2 Boolean operations on samples md\" Inference\" xyzmodel cond xyzmodel | z 3.0, Condition the model on Z 3 logprior xyzmodel cond, x 1.3, y 0.3 loglikelihood xyzmodel cond, x 1.3, y 0.3 logjoint xyzmodel cond, x 1.3, y 0.3 log prior log likelihood chain sample xyzmodel cond, NUTS , 10 000 Obtain samples from posterior summarize chain Summarize the chain means, quantiles, etc. quantile chain Quantiles, default 2.5%, 25.0%, 50.0%, 75.0%, 97.5% generated quantities xyzmodel, chain generates the result z^2 y based on the md\" Plotting\" plot chain Create diagnostic plots of the chain traceplot, etc. chain x chain x Extract samples for ’x’ chain y chain y histogram chain x, title \"Histogram of x | z 3\" Plot posterior of ’x’ md\" Calculations on posterior samples\" mean log, chain x Approximate E log X | Z 3 mean chain x . chain y Approximate P X Y | Z 3 "},{"url":"exercises/exercises/","title":"Introduction","tags":["exercises"],"text":"main a img {\n    width: 5rem;\n    margin: 1rem;\n}\nExercises descriptionHere are renders of the exercises, see all pages on the left.To download all exercises: see Ufora.We have annotated the exercises with either a number or an extra prefix.XYZWill be covered in exercise lession 1.EXTRA. XYZAdditional exercises that will not be covered in the guided exercises.Notes on the dependenciesIf you insist on downloading the exercises from this website, note that because we are rendering the notebooks here, we make use of our a specific environment. You will need to update this on your system. Look out for the cell with:using Pkg\nPkg.activate(\"../../pluto-deployment-environment\")\nChange this to the your current folder so that the Project and Manifest files are generated there:using Pkg\nPkg.activate(\".\")"},{"url":"exercises/ode_model_anaerobic_fermentation/","title":"EXTRA. ODE anaerobic fermentation","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"10\" title \"EXTRA. ODE anaerobic fermentation\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of anaerobic fermentation\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using Catalyst using DifferentialEquations, Plots using PlutoUI TableOfContents md\"\"\" Exercise Anaerobic fermentation \"\"\" md\"\"\" Part 1 \"\"\" md\"\"\" An operator at a beverage factory would like to model the anaerobic fermentation that occurs in one of his reactors. After a literature review, he finds that sucrose S is converted to ethanol E via glucose G under the action of an enzyme called invertase I from yeast using the following reaction stoichiometry all components have the unit mol\\ L^ 1 C 12 H 22 O 11 I \\xrightarrow r 1 2C 6 H 12 O 6 I C 6 H 12 O 6 \\xrightarrow r 2 2C 2 H 5 OH 2CO 2 The operator knows that both reactions are carried out in isothermal conditions in a reactor with volume V L . The operator knows from literature that the reaction rate r 1 is first order in both sucrose and invertase and with specific reaction rate k 1 . The reaction rate r 2 is second order with respect to glucose with specific reaction rate k 2 . Additionally, the reaction is inhibited by ethanol itself according to \\cfrac K E K where K represents the ethanol concentration at which r 2 achieves half of its maximum reaction rate. The initial concentrations and the parameter values are summarised in the following tables | S 0 | I 0 | G 0 | E 0 | CO 2,0 | | | | | | | | 0.04 | 0.02 | 0.00 | 0.01 | 0.00 | | k 1 | k 2 | K | | | | | | 0.40 | 0.65 | 0.50 | \"\"\" md\" Implementation of the system \" md\"\"\" Create a reaction network object model for the aforementioned problem in order to simulate the evolution of S , I , G , E and CO 2 during 1440\\ min 24\\ h . Name it `anaerobic fermentation1`. Tips For the reaction with reaction rate r 2 , in order to have a second order reaction with respect to glucose, you need to double the stoichiometric coefficients, i.e., you reaction should be 2G \\rightarrow 4E 4CO 2 . For the inhibition factor \\cfrac K E K you can use the function `mmr ..., ..., ... ` \"\"\" Uncomment and complete the instruction anaerobic fermentation1 reaction network begin species missing missing missing end md\"\"\" Check out the species. \"\"\" missing Uncomment and complete the instruction md\"\"\" Convert the system to a symbolic differential equation model and inspect your differential equations. \"\"\" osys1 missing Uncomment and complete the instruction md\"\"\" Initialize a vector `u01` with the initial conditions \"\"\" u01 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan1 missing Uncomment and complete the instruction md\"\"\" Initialize a vector `params1` with the parameter values \"\"\" params1 missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob1` \"\"\" oprob1 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol1` \"\"\" osol1 missing Uncomment and complete the instruction md\"\"\" Plot the results. Use a line width of 2 `linewidth ...` . \"\"\" missing Uncomment and complete the instruction md\"\"\" Interprete the results. Try to come up with an answer to the following questions 1. Why is the concentration of invertase I constant zero, and the concentration of sucrose S becoming zero? \"\"\" md\" Answer missing\" md\"\"\" 2. Try to explain the peak in the glucose G concentration. \"\"\" md\" Answer missing\" md\"\"\" 3. Why is the difference in ethanol E and CO 2 concentration constant? \"\"\" md\" Answer missing\" md\"\"\" Part 2 \"\"\" md\"\"\" Additionally, sucrose and glucose are added at a flow rate Q in , L\\ min^ 1 and respective concentrations S in and G in . The same flow rate is removed from the reactor but the invertase I stays in the reactor. Now the volume V of the reactor will matter. Furthermore, the invertase enzyme degrades at a rate d 0.003\\ min^ 1 . The additional parameter values are summarised in the following table | Q in | V | S in | G in | d | | | | | | | | 1.00 | 100 | 0.12 | 0.05 | 0.003 | \"\"\" md\"\"\" Make a copy of the content of the previous reaction network object and complement it with the new information. Name it `anaerobic fermentation2`. \"\"\" Uncomment and complete the instruction anaerobic fermentation2 reaction network begin species missing parameters missing missing ... missing end md\"\"\" Convert the system to a symbolic differential equation model and inspect your differential equations. \"\"\" osys2 missing Uncomment and complete the instruction md\"\"\" Make an exact copy of `u01` and rename it to `u02` with the initial conditions \"\"\" u02 missing Uncomment and complete the instruction md\"\"\" Make an exact copy of `tspan1` and rename it to `tspan2` \"\"\" tspan2 missing Uncomment and complete the instruction md\"\"\" Make a copy of `params1`, rename it to `params2` and supplement it with the new parameter values \"\"\" param2 missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob2` \"\"\" oprob2 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol2` \"\"\" osol2 missing Uncomment and complete the instruction md\"\"\" Plot the results. Use a line width of 2 `linewidth ...` . If you only want to see the curves for, e.g., E , S and G , you can use the option `idxs E, S, G ` in the `plot` command. \"\"\" missing Uncomment and complete the instruction md\"\"\" Interprete the results. \"\"\" md\" Answer missing\" md\"\"\" Check out the last concentrations at the end time for each of the species. Tips You can see the last values of all species with `osol2.u end ` If later you need all last values separately, you can access the last value of S with `osol2 S end ` and then you can put everything on one line separating the values with comma's. \"\"\" missing Uncomment and complete the instruction osol2 S end , ..., ..., ..., ... Uncomment and complete the instruction md\"\"\" Create a vector named `u guess` in the same way as `u02`, but now with the end values of the species. \"\"\" u guess2 missing Uncomment and complete the instruction md\"\"\" Calculate the steady state values of the species \"\"\" Sw2, Iw2, Gw2, Ew2, CO2w2 missing Uncomment and complete the instruction md\"\"\" Check ou the steady states \"\"\" missing md\"\"\" Part 3 \"\"\" md\"\"\" We now want to keep a relatively high production of ethanol. Therefore, if the invertase decreases to 0.008 , then the invertase is instantaneously renewed to the initial concentration of 0.02 . Apply the change in the invertase concentration using a continuous event. \"\"\" md\"\"\" Create the correct condition. \"\"\" condition3 missing Uncomment and complete the instruction md\"\"\" Include the condition into the reaction network model . \"\"\" Uncomment and complete the instruction named anaerobic fermentation3 c missing md\"\"\" Complete the reaction network model . \"\"\" Uncomment and complete the instruction anaerobic fermentation3 c com missing md\"\"\" Create a new ODE problem. \"\"\" oprob3 missing Uncomment and complete the instruction md\"\"\" Solve the new ODE problem. Make a `deepcopy`, use `Tsit5 ` and `saveat 0.5`. \"\"\" osol3 missing md\"\"\" Plot the results. \"\"\" missing md\"\"\" Interprete the results. \"\"\" md\" Answer missing\" "},{"url":"exercises/ode_model_birth_death/","title":"1. ODE birth rate","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"4\" title \"1. ODE birth rate\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of birth rate\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using PlutoUI TableOfContents using Catalyst using DifferentialEquations, Plots md\"\"\" Exercise Simple birth death model for mice In a simple birth death model for mice, the birth rate of mice represents the rate at which new individuals are added to the population through reproduction. This rate is influenced by factors such as the number of reproductive females, their fertility, and the frequency of reproduction cycles. Conversely, the death rate reflects the rate at which individuals are removed from the population due to mortality factors such as predation, disease, and environmental stressors. Together, these rates interact dynamically to shape the population dynamics of mice in their natural habitat. Denote the number of mice by X , the average birth rate by b mice day , and the average death rate by d day^ 1 . Hence, assume for this overly simplified model, that the birth of mice is a zeroth order process and that the death of mice is a first order process. \"\"\" md\"\"\" Create a reaction network object model for the aforementioned problem in order to simulate the evolution of X with time. Name it `birth death`. \"\"\" Uncomment and complete the instruction birth death reaction network begin missing end md\"\"\" Convert the system to a symbolic differential equation model and verify, by analyzing the differential equation, that your model is correctly implemented. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" Part 1 Simulate the evolution of the number of mice per day during 10 years starting off with 2 mice. Assume that per year 25 pups are born. Suppose the death rate to be 0.0015\\ day^ 1 . \"\"\" md\"\"\" First, calculate the birth rate in mice day . \"\"\" missing Uncomment and complete the instruction md\"\"\" Initialize a vector `u0` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction md\"\"\" Initialize a vector `param` with the parameter values \"\"\" params missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob` \"\"\" oprob missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Use `Tsit5 ` and `saveat 1.0`. Store the solution in `osol` \"\"\" osol missing Uncomment and complete the instruction md\"\"\" Plot the results \"\"\" missing Uncomment and complete the instruction md\"\"\" Interpret the results. Ask yourself the following questions 1. What is the approximate steady state value for X ? \"\"\" md\" Answer missing\" md\"\"\" Part 2 Suppose that at t 3\\ years the death rate of the mice population increases by 50\\,\\% due to a new predator species in the area. Use the same initial condition, timespan and parameter values. Simulate the evolution of the number of mice. \"\"\" md\"\"\" Create the condition . Store it in `condition2` \"\"\" condition2 missing Uncomment and complete the instruction md\"\"\" Make a new reaction system where the discrete event is included. Name it `birth death2`. \"\"\" named birth death2 missing Uncomment and complete the instruction md\"\"\" Complete the new reaction system . Name it `birth death2 com`. \"\"\" birth death2 com missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob2` \"\"\" oprob2 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Make a deepcopy and use `Tsit5 ` and `saveat 1.0`. Store the solution in `osol2` \"\"\" osol2 missing Uncomment and complete the instruction md\"\"\" Plot the results \"\"\" missing Uncomment and complete the instruction md\"\"\" Interpret the results. Ask yourself the following questions 1. Can you clearly see the effect of the increase in the death rate? \"\"\" md\" Answer missing\" md\"\"\" 2. If the death rate increases at a different timepoint, would you reach the same steady state value for X ? Explain. \"\"\" md\" Answer missing\" "},{"url":"exercises/ode_model_catalyst_intro/","title":"1. ODE catalyst intro","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"2\" title \"1. ODE catalyst intro\" date \"2025 02 07\" tags \"exercises\" description \"ODE catalyst intro\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element format off quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end format on end begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using PlutoUI TableOfContents using Catalyst using DifferentialEquations, Plots md\"\"\" Introduction to Catalyst ODE \"\"\" md\"\"\" Catalyst.jl is a symbolic modelling package for construction, analysis and high performance simulation of chemical reaction networks. Catalyst defines symbolic ReactionSystems, which can be created programmatically or easily specified using Catalyst's D omain S pecific L anguage DSL . \"\"\" md\"\"\" This notebook describes the syntax for building chemical reaction network models using Catalyst's DSL. We will illustrate this by implementing and solving an infection model by means of ODE O rdinary D ifferential E quations . \"\"\" md\"\"\" The infection model \"\"\" md\"\"\" It is important to model the outbreak of infectious diseases in order to devise appropriate measures to avoid global epidemics. In this exercise, we consider an isolated group of people in which a viral disease is spreading. We use an infection model similar to the SIR model but slightly extended for this purpose. We are interested in the evolution of the number of susceptible S , infected I , deceased D and resistant R persons.\\ We make the following assumptions 1. Transmission of the disease from an infected person to a susceptible person takes place through direct contact. The chance of any two inhabitants of the group coming into contact with each other is \\beta , and the probability of infection after contact between an infected and a susceptible person is \\alpha . 2. Note that the above assumption implicitly states that the probability of two neighbours coming into contact with each other is as high as the probability of two people living at two extremes of the territory coming into contact with each other. 3. A person leaves the infection period at a rate r hence, a person is contagious for an average of 1 r days. Without appropriate medication, a fraction m of infected people die and a fraction 1 m of infected people acquire immunity after healing. 4. We assume that there is no migration in or out of the population. \"\"\" md\" Below we summarize the relevant variables species \" md\"\"\" | Variable | Unit | Meaning | | | | | | ``S`` | persons | number of susceptible persons | | ``I`` | persons | number of infected persons | | ``D`` | persons | number of deceased persons | | ``R`` | persons | number of resistant persons | \"\"\" md\" Below we summarize the parameters \" md\"\"\" | Variable | Unit | Meaning | | | | | | ``\\alpha`` | ``\\frac persons contact `` | chances of getting infected after contact | | ``\\beta`` | ``\\frac contact persons^2\\,day `` | contact rate | | ``r`` | ``\\frac 1 day `` | rate of leaving infection period | | ``m`` | ``\\frac person person `` | fraction of persons deceasing | | ``1 m`` | ``\\frac person person `` | fraction of persons becoming resistant | \"\"\" md\"\"\" Hence, the infection rate is ``\\alpha \\beta``. This means that a susceptible person meets an infected person ``S I``, this will result in ``2I`` at a rate ``\\alpha \\beta``. Futhermore, an infected person ``I`` will either become a deceased person ``D`` at a rate ``m r`` or become a resistant person ``R`` at rate `` 1 m r`` \"\"\" md\"\"\" Our infection model has three reaction events 1. Infection, where a susceptible persons meets an infected persons and also becomes infected. 2. Deceasing, where an infected person die. 3. Recovery, where an infected person recovers and becomes resitant. \"\"\" md\"\"\" Each reaction is also associated with a specific rate 1. ``\\alpha \\beta``, the infection rate. 2. ``m r``, the death rate. 3. `` 1 m r``, the recovery rate. \"\"\" md\"\"\" Hence, the following infection reactions are S I \\xrightarrow \\alpha \\beta 2I I \\xrightarrow mr D I \\xrightarrow 1 m r R \"\"\" md\"\"\" We are going to implement this system of reactions using Catalyst. \"\"\" md\"\"\" We first load the Catalyst package, which is required for the code in this introduction to run \"\"\" md\"\"\" Implementation of the system The following code creates a so called reaction network object , that we have named `infection model`, that implements the aforementioned reactions . \"\"\" infection model reaction network begin α β, S I 2I r m, I D r 1 m , I R end md\" Each line between `begin` and `end` corresponds to a reaction . Each reaction consists of a reaction rate the expression on the left hand side of `,` , a set of substrates the expression in between `,` and ` ` , a set of products the expression on the right hand side of ` ` . The substrates and the products may contain one or more reactants, separated by ` `. \" md\"\"\" hint \"Hint\" The Greek letters can be visualized by typing a backslash followed by the name of the Greek letter and then the TAB key. For example `\\alpha` followed by the TAB key results in in a list where you can choose `α`. \"\"\" md\" The reaction model is stored in the variable `infection model` the variable name can be chosen freely . It is a symbolic representation of the chemical network. \" md\"\"\" You can get a list of the different reaction species with the command `species` \"\"\" species infection model md\"\"\" To get a list of the reaction parameters , you can use the command `parameters` \"\"\" parameters infection model md\"\"\" important \"Important\" You can also get the different species and parameters using ` unpack` followed by comma separated species and or parameter names followed by the equal sign and the name of the reaction network model. For example \"\"\" unpack S, I, D, R infection model md\"\"\" The reaction model can be converted to a symbolic differential equation model via \"\"\" osys convert ODESystem, infection model md\"\"\" Note that the model equations are essencially \\cfrac dS t dt \\alpha \\beta S t I t \\cfrac dI t dt \\alpha \\beta S t I t r I t \\cfrac dD t dt m r I t \\cfrac dR t dt 1 m r I t \"\"\" md\"\"\" You can get a list of the differential equations with the command `equations` \"\"\" equations osys md\"\"\" To get a list of the state variables, you can use the command `unknowns` \"\"\" unknowns osys md\"\"\" To get a list of the parameters, you can use the command `parameters` \"\"\" parameters osys md\"\"\" Simulating the system as an ODE problem We first need to load the Differential and Plot package, which is required for simulating the system and plotting the results. \"\"\" md\"\"\" Now we wish to simulate our model. To do this, we need to provide some the following information Initial conditions for the state variables S , I , D and R . The parameter values for \\alpha , \\beta , r and m . The timespan, which is the timeframe over which we wish to run the simulation. Assume in this example that there are 10\\,000\\,000 people in the country, and that initially 1\\,000 person are infected. Hence, I 0 1\\,000 , S 0 10\\,000\\,000 I 0 9\\,999\\,000 , D 0 0 and R 0 0 .\\ Furthermore, we take the following values for the parameters \\alpha 0.08\\ person contact , \\beta 10^ 6 \\ contact person^2\\,day , r 0.2\\ day^ 1 i.e. a person is contagious for an average of 5\\ days and m 0.4 . The following table summarizes the above values |Initial conditions |Parameters | | | | | S 0 9\\,999\\,000 | \\alpha 0.08 | | I 0 1\\,000 | \\beta 10^ 6 | | D 0 0 | r 0.2 | | R 0 0 | m 0.4 | Finally, we want to run our simulation from day 0 till day 90 . \"\"\" md\"\"\" Setting initial conditions \"\"\" md\"\"\" The initial conditions are given as a Vector . This is a type which collects several different values. To declare a vector, the values are specific within brackets, ` `, and separated by `,`. Since we have four species, the vector holds four elements. E.g., we set the value of I using the ` I 1` syntax. Here, we first denote the name of the species with a colon ` ` pre appended , next follows a ` ` and then the value of `I`.\\ The vector holding the initial conditions for S , I , D and R can be created in the following way \"\"\" u0 S 9 999 000.0, I 1 000.0, D 0.0, R 0.0 md\" Note that the order of the vector elements doesn't matter, because the initial values of each of the species is indicated using its variable name. \" md\"\"\" Setting the timespan \"\"\" md\"\"\" The timespan sets the time point at which we start the simulation typically `0.0` is used and the final time point of the simulation. These are combined into a two valued Tuple. Tuples are similar to vectors, but are enclosed by ` ` and not ` `. Again, we will let both time points be decimal valued. \"\"\" tspan 0.0, 90.0 md\"\"\" Setting parameter values \"\"\" md\"\"\" Similarly, the parameters values are also given as a vector. We have four parameters, hence, the parameter vector will also contain four elements. We use a similar notation for setting the parameter values as the initial condition first the colon, then the parameter name, then an arrow, then the value . \"\"\" params α 0.08, β 1.0e 6, r 0.2, m 0.4 md\"\"\" Creating an ODEProblem \"\"\" md\" Next, before we can simulate our model, we bundle all the required information together in a so called ODEProblem . Note that the order in which the input the model name, the initial condition, the timespan, and the parameter values is provided to the ODEProblem matters Here, we save our ODEProblem in the `oprob` variable. \" oprob ODEProblem infection model, u0, tspan, params md\"\"\" Solving the ODEProblem \"\"\" md\"\"\" We can now simulate our model. We do this by providing the ODEProblem to the `solve` function. There are some examples https docs.sciml.ai DiffEqDocs stable getting started online on how to solve ODE problems with the DifferentialEquations.jl package. We save the output to the `sol` variable. Optionally, one can provide a solver method https docs.sciml.ai DiffEqDocs stable solvers ode solve Full List of Methods e.g., `Tsit5` , and the time stepsize with `saveat` . \"\"\" https docs.sciml.ai DiffEqDocs stable solvers ode solve Full List of Methods osol solve oprob osol solve oprob, Tsit5 , saveat 0.5 md\"\"\" Note that at the different time points the variables values in the solution are decimal numbers and not integer numbers , despite the fact that we are applying the model to individuals. This is inherent to using an ODE approach. Later on, we will see how we can discretise the problem, and hence, work on the level of individual infections reactions .\\ Futhermore, note that executing the `solve` command at different occasions with an ODE problem will never modify the solution because ODE problems are deterministic . This will become different when simulating the individual infection reaction events by means of a stochastic random algorithm. \"\"\" md\"\"\" Plotting the results \"\"\" md\"\"\" Finally, we can plot the solution through the plot function. \"\"\" plot osol md\"\"\" If you want to plot less species, like for example just S and I , you can specify this with the option `idxs S, I ` notice the brackets in the plot function. \"\"\" plot osol, idxs S, I brackets md\"\"\" If you want a fase plot of for example just I versus S , you can specify this with the option `idxs S, I ` notice the parentheses in the plot function. You can indicate the S and I axes with the additional options `xlab \"S\"` and `ylab \"I\"`. \"\"\" plot osol, idxs S, I , xlab \"S\", ylab \"I\" parentheses md\"\"\" If you want to see the final values of S , I , D and R , type \"\"\" osol.u end md\"\"\" If you want the vector of, e.g., S values separately, type \"\"\" osol S md\"\"\" If you want the last value in the S vector, type \"\"\" osol S end md\"\"\" If you want the time vector separately, type \"\"\" osol.t md\" More advanced examples \" md\"\"\" In Example 1 we will show you one way of how you could analyze the simulation results for a limited range of parameter values. In Examples 2 and 3 we will apply some new concepts, namely discrete and continuous events. The latter will basically affect, e.g., one or more parameter values or state variables during the solving process based on one or more conditions also called events . These conditions can be either time or state variable related A time related condition is a vector of one or more timepoint s for which the value of one or more parameter s or state variable s need to be altered. We refer to them as discrete events . A state variable related condition is usually a condition for a certain value of a state variable. We will refer to them as continuous events . \"\"\" md\"\"\" Important remark \\ You may have noticed that while using the Pluto notebooks, when you change the value of some variable e.g., a parameter or an initial condition that your results plots will subsequently and automatically be altered based on the currect variable values in memory. In some cases this can be advantageous, in others not. For the latter reason, in this notebook, we will use slightly different variable names for some variables in order not to alter other results. \"\"\" md\"\"\" Example 1 Influence of r Influence of the duration of infection 1 r for average infection periods of between 10 , days and 1 day contagious r between 0.1 and 1.0 , step 0.1 , default value 0.1 . \"\"\" md\"\"\" We will create a slider for the r values between 0.1 and 1.0 , stepsize 0.1 , default value 0.1 . \"\"\" bind r Slider 0.1 0.1 1, default 0.1, show value true md\"\"\" We will create een new parameter value vector, ODE problem and solution object by putting `1` at the end of the corresponding variable names. In that way, the previous simulation results will be unaffected The model, the initial conditions and the timespan are identical as before. In there we also use the variable `r` coupled to the slider. \"\"\" params1 α 0.08, β 1.0e 6, r r, m 0.4 put semi colon at end of instruction to avoid seeing its output. oprob1 ODEProblem infection model, u0, tspan, params1 osol1 solve oprob1, Tsit5 , saveat 0.5 plot osol1, ylim 0, 1e7 md\"\"\" Now, change the value of r in the `param1` vector and analyze the effect in the plot. \"\"\" md\"\"\" Try to interpret the results yourself. Ask yourself the following questions 1. What are the trends in the results obtained? \"\"\" md\" Answer missing\" md\"\"\"2. How can this be explained from the model structure?\"\"\" md\" Answer missing\" md\"\"\" Example 2 Discrete Event Suppose that regulations are such that on day 14, people need to reduce their contacts by 50%. Hence, this means that the parameter value \\beta needs to be divided by a factor of 2 at timepoint 14. In order to realize that we need to now the order of the parameters in the model because we will need to address the value of \\beta by means of an index. \"\"\" md\"\"\" We need to state that the parameter \\beta needs to be reduce by 50\\% at time t 14\\,days . We put this in a condition named `condition2`. \"\"\" condition2 14.0 infection model.β ~ infection model.β 2 md\"\"\" The discrete time event needs to be included in our model. \"\"\" named infection model2 ReactionSystem equations infection model , discrete events condition2 md\"\"\" After that, we need to complete our reaction network model . \"\"\" infection model2 com complete infection model2 md\"\"\" Then we need to create a new ODE problem. \"\"\" oprob2 ODEProblem infection model2 com, u0, tspan, params md\"\"\" Finally, the ODE problem can be solved. Notice that you need to make a deepcopy of the ODE problem, because otherwise changes to the parameter \\beta will remain after the first call to `solve`. \"\"\" osol2 solve deepcopy oprob2 , Tsit5 , saveat 0.5 md\"\"\" Now we can plot the results. \"\"\" plot osol2 md\"\"\" If you want to see the final values of S , I , D and R , type \"\"\" osol2.u end md\"\"\" Try to interpret the results yourself. Ask yourself the following questions 1. What are the trends in the results obtained? \"\"\" md\" Answer missing\" md\"\"\" 2. How much less casualties are there compared to not altering the contact rate? \"\"\" md\" Answer missing\" md\"\"\" Example 3 Continuous Event Suppose that when the number of infected individuals reaches 1\\,000\\,000 , then 999\\,000 of them are promptly put into isolation or removed from the population . Hence, a 1000 individuals remain infected at some point. \"\"\" md\"\"\" Normally in a continuous event the value of one or more species can be changed when a certain condition is met. In our specific case we want the change in the species happening only once So, if you want that the continuous event ''when I reaches 10^6 then 999000 is subtrated from I '' happens only once, then we need to include a ficticious new species in our reaction network model . We will call this ficticious species `pwc` a short for p roceed w ith c ondition and we set it default to `true`. \"\"\" infection model3 reaction network begin species pwc t true α β, S I 2I r m, I D r 1 m , I R end species infection model3 md\"\"\" We create the condition in the following way. When `pwc` is true then I will be changed and also `pwc` will become `false`, so that the condition happens only once. We assume hereby that I will never reach 0 \"\"\" condition3 infection model3.I ~ 1e6 infection model3.pwc infection model3.I ~ infection model3.I 0.999e6, infection model3.pwc ~ false md\"\"\" The continuous event needs to be included in our model. \"\"\" named infection model3 c ReactionSystem equations infection model3 , continuous events condition3 md\"\"\" After that, we need to complete our reaction network model . \"\"\" infection model3 c com complete infection model3 c md\"\"\" Then we need to create a new ODE problem. \"\"\" oprob3 ODEProblem infection model3 c com, u0, tspan, params md\"\"\" Finally, the ODE problem can be solved. Notice that you need to make a deepcopy of the ODE problem again. \"\"\" osol3 solve deepcopy oprob3 , Tsit5 , saveat 0.1 md\"\"\" Now we can plot the results. \"\"\" plot osol3 md\"\"\" If you want to see the final values of S , I , D , R and `pwc`, type \"\"\" osol3.u end md\"\"\" Try to interpret the results yourself. Ask yourself the following questions 1. What are the trends in the results obtained? \"\"\" md\" Answer missing\" md\"\"\" 2. How much less casualties are there compared to not putting 999\\,000 individuals into isolation? Hint you also need to take into account the casualties in the 999\\,000 individuals that had been put into isolation. \"\"\" md\" Answer missing\" "},{"url":"exercises/ode_model_fermenter_firstorder/","title":"EXTRA. ODE fermentor first order","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"6\" title \"EXTRA. ODE fermentor first order\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of a first order fermentor\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using Catalyst using DifferentialEquations, Plots md\"\"\" Exercise Fermenter First order kinetics \"\"\" md\"\"\" In a fermenter reactor biomass X grows on substrate S . The reactor is fed with a inlet flow rate Q in L h , which consist of a manipulable input concentration of substrate S in g L . Inside the reactor, biomass, with a concentration of X g L , is produced through first order kinetics first order in S \\begin eqnarray % S \\xrightarrow \\quad\\quad \\beta Y \\, X S \\xrightarrow \\quad\\quad \\text r Y \\, X \\quad\\quad\\quad\\quad r \\beta \\, S \\end eqnarray with \\beta h^ 1 the reaction rate constant, and Y gX gS the yield coefficient which is defined here by the amount of produced biomass by consumption of one unit of substrate. Futhermore, the reactor is drained with an outlet flow Q L h , which consist of the current concentrations of substrate S g L and biomass X g L inside the reactor. The volume V L of the reactor content is kept constant by setting Q in Q . \"\"\" md\"\"\" Create a reaction network object model for the aforementioned problem in order to simulate the evolution of substrate S and biomass X with time. Name it `fermenter firstorder`. \"\"\" Uncomment and complete the instruction fermenter firstorder reaction network begin missing Y X is created from one S at a rate β missing S is created at a rate Q V Sin missing S and X are degraded at a rate Q V S end md\"\"\" Convert the system to a symbolic differential equation model and verify, by analyzing the differential equation, that your model is correctly implemented. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" The parameter values are \\beta 0.98 , Y 0.80 , Q 2.0 , V 40.0 and S in 2.2\\ g L . With the latter values, the fermenter reactor is in steady state operation with concentrations for substrate S 0.1068\\ g L and biomass X 1.6746\\ g L . Suppose that at timepoint t 20\\ h , the concentration of substrate in the inlet flow cf. S in is suddently increased to 3.4\\ g L . Simulate the evolution of S and X during 120 hours. \"\"\" md\"\"\" Initialize a vector `u₀` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction md\"\"\" Initialize a vector `params` with the parameter values \"\"\" params missing Uncomment and complete the instruction md\"\"\" Create the condition that contains the timepoint for the sudden change in S in . Store it in `condition` \"\"\" condition missing md\"\"\" Make a new reaction system where the discrete event is included. Name it `fermenter firstorder2`. \"\"\" named fermenter firstorder c missing md\"\"\" Complete the new reaction system . Name it `fermenter firstorder c com`. \"\"\" fermenter firstorder c com missing md\"\"\" Create the ODE problem and store it in `oprob` \"\"\" oprob missing md\"\"\" Solve the ODE problem. Make a deepcopy and use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol` \"\"\" osol missing md\"\"\" Plot the results \"\"\" missing md\"\"\" Interpret the results. Ask yourself the following questions 1. Can you clearly see the effect of the increase in S in ? \"\"\" md\" Answer missing\" md\"\"\" 2. Can you argue, by means of reasoning or by determining and analyzing the operating point, why the increase of X is larger than the increase of S ? \"\"\" md\" Answer missing\" "},{"url":"exercises/ode_model_fermenter_monod/","title":"EXTRA. ODE fermentor monod","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"7\" title \"EXTRA. ODE fermentor monod\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of a fermentor monod\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using Catalyst using DifferentialEquations, Plots md\" Exercise Fermenter Monod kinetics \" md\"\"\" In a fermenter reactor biomass grows on substrate. The reactor is fed with a inlet flow rate Q in L h , which consist of a manipulable input concentration of substrate S in g L . Inside the reactor, biomass, with a concentration of X g L , is produced through Monod kinetics \\begin eqnarray %S \\xrightarrow \\quad\\quad \\beta Y \\, X S \\xrightarrow \\quad\\quad r Y \\, X \\quad\\quad\\quad\\quad r \\mu \\, X \\end eqnarray where \\mu \\mu max \\, \\cfrac S S K s is called the specific growth rate h^ 1 . Therein, \\mu max is the maximum speficic growth rate, and K s g L is the so called half velocity constant i.e. the value of S when \\mu \\mu max 0.5 . Futhermore, Y gX gS is the yield coefficient which is defined here by the amount of produced biomass by consumption of one unit of substrate. The reactor is drained with an outlet flow Q L h , which consist of the current concentrations of substrate S g L and biomass X g L inside the reactor. The volume V L of the reactor content is kept constant by setting Q in Q . \"\"\" md\"\"\" Create a reaction network object model for the aforementioned problem in order to simulate the evolution of substrate S and biomass X with time. Name it `fermenter monod`. Tip The specific growth rate \\mu \\mu max \\, \\cfrac S S K s can be implemented with `mm S, μmax, Ks `. The function `mm` stands for the Michaelis Menten kinetics, whcih is equivalent to Monod kinetics. \"\"\" fermenter monod reaction network begin ... Y X is created from one S at a rate mm S, μmax, Ks X ... S is created at a rate Q V Sin ... S and X are degraded at a rate Q V S end md\"\"\" Convert the system to a symbolic differential equation model and verify, by analyzing the differential equation, that your model is correctly implemented. Keep in mind that `mm S, μmax, Ks ` stands for \\mu max \\, \\cfrac S S K s . \"\"\" osys missing md\"\"\" The parameter values are \\mu max 0.40 , K s 0.015 , Y 0.67 , Q 2.0 , V 40.0 and S in 0.02\\ g L . Suppose that at t 0\\ h no substrate S is present in the reactor but that there is initially some biomass with a concetration of 0.0005\\ g L . Simulate the evolution of S and X during 200 hours. \"\"\" md\"\"\" Initialize a vector `u0` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction md\"\"\" Initialize a vector `param` with the parameter values \"\"\" params missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob` \"\"\" oprob missing Uncomment and complete the instruction md\"\"\" Part 1 Solve the ODE problem. Use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol1` \"\"\" osol1 missing Uncomment and complete the instruction md\"\"\" Plot the results \"\"\" missing Uncomment and complete the instruction md\"\"\" Inspect the final values in both the S and X vector.\\ Tip use something like ` osol1 ... ... , osol1 ... ... ` \"\"\" osol1 ... ... , osol1 ... ... Uncomment and complete the instruction md\"\"\" We will now show you how to determine the steady state values for S and X under the current conditions cf. current initial values and current parameter values . \"\"\" md\"\"\" First, we initialize a vector `u guess1` with the final values for S and X \"\"\" u guess1 missing md\"\"\" Then we make a so called SteadyStateProblem based on the ODEProblem but now with `u guess1` as initial conditions Finally we use `solve` to solve the steady state problem. The outputs are the steady state values for S and X which we have denoted as `Seq1` and `Xeq1`. \"\"\" Seq1, Xeq1 missing md\"\"\" Next, we can just inspect these values \"\"\" missing md\"\"\" Interpret the results. Ask yourself the following questions 1. Explain why S first increases and then decreases while X only increases during the first 50 hours. \"\"\" md\" Answer missing\" md\"\"\" 2. What are the steady state values of S and X . \"\"\" md\" Answer missing\" md\"\"\" Part 2 Suppose that the substrate inlet concentration S in suddenly increases to 0.022\\ g L at t 100\\ h . Simulate the evolution of S and X . \"\"\" md\"\"\" Create the condition that contains the timepoint for the sudden change in S in . Store it in `condition2` \"\"\" condition2 missing Uncomment and complete the instruction md\"\"\" Make a new reaction system where the discrete event is included. Name it `fermenter monod2`. \"\"\" named fermenter monod2 missing Uncomment and complete the instruction md\"\"\" Complete the new reaction system . Name it `fermenter monod2 com`. \"\"\" fermenter monod2 com missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob2` \"\"\" oprob2 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Make a deepcopy and use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol2` \"\"\" osol2 missing Uncomment and complete the instruction md\"\"\" Plot the results \"\"\" missing md\"\"\" Calculate the state state values for S and X . \"\"\" md\"\"\" Inspect the final values in both the S and X vector.\\ Tip use something like ` osol2 ... ... , osol2 ... ... ` \"\"\" osol2 ... ... , osol2 ... ... Uncomment and complete the instruction md\"\"\" Initialize a vector `u guess2` with the final values for S and X \"\"\" u guess2 missing Uncomment and complete the instruction md\"\"\" Initialize a vector `param mod` with the parameter values. Notice that all parameter values will be the same, except the one of S in . \"\"\" params mod missing Uncomment and complete the instruction md\"\"\" Make and solve the steady state problem. Call the output values `Seq2` and `Xeq2`. \"\"\" Seq2, Xeq2 missing Uncomment and complete the instruction md\"\"\" Inspect those values. \"\"\" missing Uncomment and complete the instruction md\"\"\" Interpret the results. Ask yourself the following questions 1. Can you clearly see the effect of the increase in S in ? \"\"\" md\" Answer missing\" md\"\"\" 2. Find the steady state values of S and X . Is the steady state value of S influenced by the increase of S in ? Show how you can deduce that from the differential equations. \"\"\" md\" Answer missing\" md\"\"\" 3. Can you explain why X increased permanently? \"\"\" md\" Answer missing\" md\"\"\" Part 3 Suppose that the inlet outlet flow Q is suddenly doubled at t 100\\ h . Simulate the evolution of S and X . \"\"\" md\"\"\" Create the condition that contains the timepoint for the sudden change in Q . Store it in `condition3` \"\"\" condition3 missing Uncomment and complete the instruction md\"\"\" Make a new reaction system where the discrete event is included. Name it `fermenter monod3`. \"\"\" named fermenter monod3 missing Uncomment and complete the instruction md\"\"\" Complete the new reaction system . Name it `fermenter monod3 com`. \"\"\" fermenter monod3 com missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob3` \"\"\" oprob3 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Make a deepcopy and use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol3` \"\"\" osol3 missing Uncomment and complete the instruction md\"\"\" Plot the results \"\"\" missing Uncomment and complete the instruction md\"\"\" Interpret the results. Ask yourself the following questions 1. Can you clearly see the effect of doubling of Q ? \"\"\" md\" Answer missing\" md\"\"\" 2. Can you argue, by means of reasoning, why S increases and X decreases? \"\"\" md\" Answer missing\" "},{"url":"exercises/ode_model_infection/","title":"1. ODE infection","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"3\" title \"1. ODE infection\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of infection\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element format off quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end format on end begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using PlutoUI TableOfContents using Catalyst using DifferentialEquations, Plots md\" Exercises infection model \" md\"\"\" We will work here with the same infection model as in the Introdution to Catalyst revisit the concerned notebook if necessay . We shortly summarize some important aspects of the model and give a condensed version of the solution method and the examples. \"\"\" md\"\"\" The state variables | Variable | Unit | Meaning | | | | | | ``S`` | persons | number of susceptible persons | | ``I`` | persons | number of infected persons | | ``D`` | persons | number of deceased persons | | ``R`` | persons | number of recovered persons | \"\"\" md\"\"\" The parameters | Variable | Unit | Meaning | | | | | | ``\\alpha`` | ``\\frac persons contact `` | chances of getting infected after contact | | ``\\beta`` | ``\\frac contact persons^2\\,day `` | contact rate | | ``r`` | ``\\frac 1 day `` | rate of leaving infection period | | ``m`` | ``\\frac person person `` | fraction of persons deceasing | | ``1 m`` | ``\\frac person person `` | fraction of persons becoming resistant | \"\"\" md\"\"\" The infection model has three reaction events Infection, where a susceptible persons meets an infected persons and also becomes infected. The infection rate is \\alpha \\beta . Deceasing, where an infected person die. The death rate is m r . Recovery, where an infected person recovers. The recovery rate 1 m r . \"\"\" md\"\"\" The infection reactions are S I \\xrightarrow \\alpha \\beta 2I I \\xrightarrow mr D I \\xrightarrow 1 m r R \"\"\" md\"\"\" Load the Catalyst package \"\"\" md\"\"\" Examples \"\"\" md\" Implementation of the system \" infection model reaction network begin α β, S I 2I r m, I D r 1 m , I R end md\"\"\" The species \"\"\" species infection model md\"\"\" Alternatively \"\"\" unpack S, I, D, R infection model md\"\"\" The parameters \"\"\" parameters infection model md\" Convert the reaction model if you want to see the symbolic differential equation model \" osys convert ODESystem, infection model md\"\"\" Getting a list of the differential equations, the state variables and the parameters \"\"\" equations osys unknowns osys parameters osys md\"\"\" Simulating the system as an ODE problem Load the packages Differential and Plot \"\"\" md\"\"\" Setting initial conditions, timespan and parameter values \"\"\" u0 S 9 999 000.0, I 1 000.0, D 0.0, R 0.0 tspan 0.0, 90.0 params α 0.08, β 1.0e 6, r 0.2, m 0.4 md\"\"\" Creating and solving the ODEProblem and plotting results \"\"\" oprob ODEProblem infection model, u0, tspan, params osol solve oprob, Tsit5 , saveat 0.5 plot osol plot osol, idxs S, I only S and I plot osol, idxs S, I , xlab \"S\", ylab \"I\" fase plot I vs S osol.u end md\"\"\" Example 1 Influence of r Influence of the duration of infection 1 r for average infection periods of between 10 , days and 1 day contagious r between 0.1 and 1.0 , step 0.1 , default value 0.1 . \"\"\" bind r Slider 0.1 0.1 1, default 0.1, show value true params1 α 0.08, β 1.0e 6, r r, m 0.4 oprob1 ODEProblem infection model, u0, tspan, params1 osol1 solve oprob1, Tsit5 , saveat 0.5 plot osol1, ylim 0, 1e7 md\"\"\" Change the value of r in the `params1` vector to visualize the effect in the plot. \"\"\" md\"\"\" Example 2 Discrete event Suppose that regulations are such that on day 14, people need to reduce their contacts by 50%. \"\"\" condition2 14.0 infection model.β ~ infection model.β 2 named infection model2 ReactionSystem equations infection model , discrete events condition2 infection model2 com complete infection model2 oprob2 ODEProblem infection model2 com, u0, tspan, params osol2 solve deepcopy oprob2 , Tsit5 , saveat 0.5 plot osol2 osol2.u end md\"\"\" Example 3 Continuous event Suppose that when the number of infected individuals reaches 1\\,000\\,000 , then 999\\,000 of them are promptly put into isolation or removed from the population . \"\"\" infection model3 reaction network begin species pwc t true α β, S I 2I r m, I D r 1 m , I R end condition3 infection model3.I ~ 1e6 infection model3.pwc infection model3.I ~ infection model3.I 0.999e6, infection model3.pwc ~ false named infection model3 c ReactionSystem equations infection model3 , continuous events condition3 infection model3 c com complete infection model3 c oprob3 ODEProblem infection model3 c com, u0, tspan, params osol3 solve deepcopy oprob3 , Tsit5 , saveat 0.5 plot osol3 osol3.u end md\"\"\" Exercises \"\"\" md\"\"\" Exercise 1 Influence of \\alpha Evaluate the effect of a decreasing risk of infection after contact with an infected person, i.e. r 0.2 , \\beta 0.1 and \\alpha between 8\\% and 20\\% . Use the same initial values and timespan as before. \"\"\" md\"\"\" Make a slider for \\alpha in the range of 0.08 and 0.20 with a step of 0.02 . Take a default value of 0.08 . \"\"\" missing Uncomment and complete the instruction md\" Initialize vector `params ex1` with parameter values \" params ex1 missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob ex1` \"\"\" oprob ex1 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem and store the solution in `osol ex1` \"\"\" osol ex1 missing Uncomment and complete the instruction md\"\"\" Plot the solutions \"\"\" missing Uncomment and complete the instruction md\"\"\" Change the value of \\alpha in the `params ex1` vector to visualize the effect in the plot. \"\"\" md\"\"\" Try to interpret the results yourself. Ask yourself the following questions 1. What are the trends in the obtained results? \"\"\" md\" Answer missing\" md\"\"\" 2. How can this be explained from the model structure? \"\"\" md\" Answer missing\" md\"\"\" Exercise 2 Administration of medicinal products Scientists have developed a medicine that heals sick people and makes them immune to the disease. After administering medication, the infection duration is reduced to two days. All treated patients heal and acquire immunity to the virus. The model will have to be extended with two additional parameters. Parameter b the fraction of infected persons undergoing treatment. Parameter h the rate at which the infected persons treated are no longer contagious day^ 1 . Administering the drug to a fraction of the infected individuals affects two reactions I \\rightarrow D and I \\rightarrow R , with the following assumptions The fraction of infected persons treated b has a reduced infection duration. The fraction of infected individuals not receiving treatment 1 − b still has the same duration of infection. The mortality rate m only affects the group of sick people who were not given any medication. All treated individuals recover. A fraction of the untreated individuals also heals. Check the effect on the epidemic when 0\\% , 25\\% , 50\\% , 75\\% and 100\\% of infected individuals are treated with h 0.5 . Use the same initial conditions and timespan as before. \"\"\" md\"\"\" Set up the new reaction network model and name it `infection med` \"\"\" infection med reaction network begin Uncomment and complete the instruction α β, S I 2I ..., I D ..., ... , I R end md\"\"\" Convert to an ODE system. Check the differential equations and make sure you understand each term. \"\"\" osys ex2 missing Uncomment and complete the instruction md\"\"\" Set up parameter values \"\"\" params ex2 missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob ex2` \"\"\" oprob ex2 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem and store the solution in `osol ex2` \"\"\" osol ex2 missing Uncomment and complete the instruction md\"\"\" Plot the solutions \"\"\" missing Uncomment and complete the instruction md\"\"\" Change the value of b in the `params ex2` vector to visualize the effect in the plot. Interpret the obtained plots. \"\"\" md\"\"\" Try to answer the following questions 1. Why does the peak in the number of infected individuals shift to the right when the value of b increases? \"\"\" md\" Answer missing\" md\"\"\" 2. Why does the number of recovered individuals first rise when the value of b increases and then fall when the value of b continues to increase? \"\"\" md\" Answer missing\" md\"\"\" Check the number of fatalities \"\"\" missing md\"\"\" Exercise 3 Adding vaccination to the model Scientists have developed a vaccine that makes healthy people immediately immune to the disease. Vaccination affects several differential equations Susceptible individuals are vaccinated at a rate of v with unit day^ 1 . These persons can therefore no longer be infected. The vaccinated persons become resistant. We are going to use a vaccination rate v so that the number of fatalities is about 10 times smaller after a period of 90 days compared to those in absence of vaccination cf. Exercise 2 . The vaccination programme is launched 2 days after the outbreak of the disease. Assume that individuals are still being treated b 0.2 and h 0.5 . Extend the model obtained in the previous exercise for the launch of a vaccination campaign after the outbreak of the disease. Find out via trial and error what the minimum vaccination rate need to be so that the number of fatalities is 10 times smaller after a period of 90 days compared to those in absence of vaccination cf. Exercise 2 . Consider an initial step size in v of 0.01 and then fine tune with a step size of 0.001 . Use the same initial values and timespan as before. \"\"\" md\"\"\" Set up the new reaction network model and name it `infection med vac` \"\"\" Uncomment and complete the instruction infection med vac reaction network begin α β, S I 2I ..., I D ..., ... , I R ..., ... ... end md\"\"\" Convert to an ODE system. Check the differential equations and make sure you understand each term. \"\"\" osys ex3 missing Uncomment and complete the instruction md\"\"\" Make a slider and bind it to the variable `v`. Use a range 0.0, 0.1 , step size 0.001 and default value of 0.0 . \"\"\" missing Uncomment and complete the instruction md\"\"\" Set up parameter values \"\"\" params ex3 missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob ex3` \"\"\" oprob ex3 missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem for step wise increasing values of v and store the solution in `osol ex3 vac`. Consider an initial step size in v of 0.01 and then fine tune with a step size of 0.001 . \"\"\" osol ex3 no vac missing Uncomment and complete the instruction md\"\"\" Compare the latter with the number of fatalities when no vaccination is was available cf. Exercise 2 by setting up a condition a boolean expression return either `true` or `false` here below where the final number of fatalities with vaccination divided by 10 is compared with use larger than or smaller than the number of fatalities without vaccination \"\"\" missing Uncomment and complete the instruction md\"\"\" Once you have found the required value of v launch the vaccination programme 2 days after the outbreak. Set up the 2 day time condition and store it in `condition ex3` \"\"\" condition ex3 missing Uncomment and complete the instruction md\"\"\" Make a new reaction system where the discrete event is included. Name it `infection med vac c`. \"\"\" named infection med vac c missing Uncomment and complete the instruction md\"\"\" Complete the new reaction system . Name it `infection med vac c com`. \"\"\" infection med vac c com missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob ex3 c` \"\"\" oprob ex3 c missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Make a deepcopy and use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol ex3`. \"\"\" osol ex3 missing Uncomment and complete the instruction md\"\"\" Plot the solutions \"\"\" missing Uncomment and complete the instruction "},{"url":"exercises/ode_model_irrigation/","title":"1. ODE irrigation","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"5\" title \"1. ODE irrigation\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of irrigation\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using PlutoUI TableOfContents using Catalyst using DifferentialEquations, Plots md\"\"\" Exercise Irrigation experiment \"\"\" md\"\"\" An irrigation experiment is carried out on a soil column consisting of two layers of soil, each with specific soil characteristics. An adjustable volume of water per unit of time, r , is irrigated evenly over the soil column, starting with 5\\ mm\\,h^ 1 mm indicates a volume of water 1\\ mm 10^ 3 \\,m^3 . After 60\\ h the added flow rate is increased to 10\\ mm\\,h^ 1 . The water falls on the upper layer and percolates to the lower layer. The relative moisture content in both layers i.e., relative to their residual moisture contents is denoted by S 1 and S 2 . Initially a moisture content of 30\\ mm is present in the upper layer cf. S 1 and of 25\\ mm in the lower layer cf. S 2 . The residual moisture content in the upper layer is S 1,res 10 \\ mm . A model description of the relative moisture content in both soil layers is given by \\begin align \\frac dS 1 dt & r\\left 1 \\cfrac S 1,res S max \\right \\cfrac r S max S 1 \\cfrac k S max S 1 \\\\ \\frac dS 2 dt & \\cfrac k S max S 1 v \\,S 2^2 \\end align Here S max 150\\ mm is the saturated water quantity for the top soil layer, k is the percolation ratio 3\\ mm\\,h^ 1 and v is the flow factor into the groundwater 10^ 3 \\ h^ 1 \\,mm^ 1 . Three measurements are made over the duration 150\\ h of the experiment The excess running water runoff r \\cfrac S 1 S 1,res S max , The underground outflow into groundwater v\\,S 2^2 , The amount of percolation to deeper soil layers \\cfrac k S max S 1 . The latter three are called observables . \"\"\" md\"\"\" Create a reaction network object model for the aforementioned problem in order to simulate the evolution of the three afore mentioned measurements during 150\\ h . Name it `irrigation mod`. Tips You can use any kind of expression for the reaction rates. The term v \\,S 2^2 is created by the reaction `v, 2S₂ 0` \"\"\" Uncomment and complete the instruction irrigation mod reaction network begin missing ... end md\"\"\" Convert the system to a symbolic differential equation model and verify, by analyzing the differential equation, that your model is correctly implemented. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" Initialize a vector `u0` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction md\"\"\" Initialize a vector `params` with the parameter values \"\"\" params missing Uncomment and complete the instruction md\"\"\" Unpack the variables and parameters so that we can use them in an intuitive way to calculate to observables. For R we will take the value of 5 10 2 7.5 . \"\"\" unpack ..., ..., ..., ..., ..., ... ... Uncomment and complete the instruction md\"\"\" Create the condition that contains the timepoint for the sudden change in R . Store it in `condition` \"\"\" condition missing Uncomment and complete the instruction md\"\"\" Make a new reaction system where the discrete event is included. Name it `irrigation mod c`. \"\"\" named irrigation mod c missing md\"\"\" Complete the new reaction system . Name it `irrigation mod c com`. \"\"\" irrigation mod c com missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob` \"\"\" oprob missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Use `Tsit5 ` and `saveat 0.5`. Store the solution in `osol` \"\"\" osol missing Uncomment and complete the instruction md\"\"\" Calculate the observables. Take r 5.0 10.0 2 7.5 . We summarize the observables here. The excess running water runoff R \\cfrac S 1 S 1,res S max , The underground outflow into groundwater v\\,S 2^2 , The amount of percolation to deeper soil layers \\cfrac k S max S 1 . \"\"\" Uncomment and complete the instruction begin runoff ... outflow ... percolation ... end md\"\"\" Plot the runoff, outflow and percolation. \"\"\" plot osol idxs ..., ..., ... , labels \"...\" \"...\" \"...\" md\"\"\" Interpret the results. Ask yourself the following questions 1. Can you clearly see the effect of the increase in r ? \"\"\" md\" Answer missing\" md\"\"\" 2. Argue why the outflow and the percolation tend to the same value. \"\"\" md\" Answer missing\" "},{"url":"exercises/ode_model_soil_cont_plant_uptake/","title":"EXTRA. ODE soil","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"8\" title \"EXTRA. ODE soil\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of soil\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using Catalyst using DifferentialEquations, Plots md\"\"\" Exercise Soil Contamination with Plant Uptake \"\"\" md\"\"\" The following system of differential equations models the decay of a pollutant in soil and its uptake by plants. The variable C t in mg kg is the concentration of the pollutant in the soil and P t in mg kg is the concentration of the pollutant in the plants at time t . \\begin align \\cfrac dC dt & r k 1 C t k 2 C t P t \\\\ \\cfrac dP dt & k 2 C t P t k 3 P t \\end align The interpratation of the parameters is the following r represents the rate at which the pollutant enters the soil from external sources. k 1 is the natural degradation rate of the pollutant in the soil. k 2 is the uptake coefficient, representing the rate at which plants absorb pollutant from the soil. k 3 is the natural degradation rate of the pollutant in the plant. The natural degradation of the pollutant in the soil or plant could be accounted for by processes like radiation decay, microbial degradation, volatilization, or leaching. \"\"\" md\"\"\" Model the aforementioned system of differential equations using a reaction network object . Name it `soil cont plant uptake`. \"\"\" Uncomment and complete the instruction soil cont plant uptake reaction network begin missing end md\"\"\" Convert the system to a symbolic differential equation model and verify that you get the same system of differential equations as given in the problem. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" Suppose that we simulate the evoluation of the pollutant in the soil and plant during 400 days. The inital pollutant concentrations in the soil and plant both have the value of 0.001\\ mg kg . In the simulation, the soil is being contaminated at a rate 0.06\\ mg kg \\cdot day . The degradation rates and uptake coefficient have the following values k 1 4.1 \\times 10^ 3 , k 2 1.9 \\times 10^ 2 , k 3 2.2 \\times 10^ 2 . There units are consistent with the units of the aforementioned values. \"\"\" md\"\"\" Initialize a vector `u0` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction md\"\"\" Initialize a vector `param` with the parameter values \"\"\" params missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob` \"\"\" oprob missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Use `Tsit5 ` and `saveat 1.0`. Store the solution in `osol` \"\"\" osol missing Uncomment and complete the instruction md\"\"\" Plot the solutions \"\"\" missing Uncomment and complete the instruction md\"\"\" 1. Interprate the simulation results cf. peak in C and increase of P in terms of the used parameter values. \"\"\" md\" Answer missing\" md\"\"\" 2. How would you modify the basic model to make it a more realistic biological model cf. hill, monod, ... . \"\"\" md\" Answer missing\" md\"\"\" 3. What are the units of the parameters k₁, k₂ and k₃? \"\"\" md\" Answer missing\" "},{"url":"exercises/ode_model_water_evap_infil/","title":"EXTRA. ODE water evaporation","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"9\" title \"EXTRA. ODE water evaporation\" date \"2025 02 07\" tags \"exercises\" description \"ODE model of water evaporation\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using PlutoUI using Catalyst using DifferentialEquations, Plots hint text Markdown.MD Markdown.Admonition \"hint\", \"Hint\", text md\"\"\" Exercise Water evaporation and infiltration Consider a water reservoir, such as a lake, where the water in the reservoir is in contact with the air as well as with the groundwater. We will denote the water level in the reservoir as W and the groundwater level as G . The water in the reservoir evaporates at a rate k 1 i.e. the evaporation coefficient and there can be infiltration into or from the groundwater at a rate k 2 i.e., infiltration coefficient depending on the difference in the water level in the reservoir and groundwater cf. W G There is a natural constant inflow of water into the reservoir at a rate I . At time t 0\\ s a pumping device is switched on such that the reservoir is rapidly being emptied at an outflow rate O until the level of the water reservoir drops to zero. From then on, the pump is switched off. \"\"\" md\"\"\" question Set up a system of differential equations modelling the above problem. \"\"\" hint md\"\"\" The system of differential equations that models the water level in a reservoir W and the groundwater level G considering evaporation, infiltration, inlet flow and outlet flow can be written down as \\begin align \\frac dW dt & I O k 1 \\cdot W k 2 \\cdot W G \\\\ \\frac dG dt & k 2 \\cdot W G \\end align \"\"\" md\"\"\" Model the aforementioned system of differential equations using a reaction network object . Name it `water evap infil`. \"\"\" Uncomment and complete the instruction water evap infil reaction network begin missing end md\"\"\" Convert the system to a symbolic differential equation model and verify that you get the same system of differential equations as given in the problem. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" Both water levels are initially 6.75\\ m . The inflow rate is constant and is 2.7\\ m min . The evaporation and infiltration coefficient are 0.4\\ min^ 1 and 1.0\\ min^ 1 respectively. The outflow rate due to the pump is 20\\ m min and the pump stops working when W equals zero. We wish to simulate the evolution of W and G during 20\\ min . \"\"\" md\"\"\" Initialize a vector `u0` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction md\"\"\" Initialize a vector `param` with the parameter values \"\"\" params missing Uncomment and complete the instruction md\"\"\" Set up a the condition , name it `condition`. \"\"\" condition missing Uncomment and complete the instruction md\"\"\" Make a new reaction system where the discrete event is included. Name it `water evap infil c`. \"\"\" named water evap infil c missing Uncomment and complete the instruction md\"\"\" Complete the new reaction system . Name it `water evap infil c com`. \"\"\" water evap infil c com missing Uncomment and complete the instruction md\"\"\" Create the ODE problem and store it in `oprob` \"\"\" oprob missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Make a deepcopy and use `Tsit5 ` and `saveat 0.1`. Store the solution in `osol` \"\"\" osol missing Uncomment and complete the instruction md\"\"\" Plot the results \"\"\" missing Uncomment and complete the instruction md\"\"\" Interpret the results. Ask yourself the following questions 1. Can you clearly see the drop in W ? To what value does W drops? \"\"\" md\" Answer missing\" md\"\"\" 2. Why does G also drop when W drops? Explain. \"\"\" md\" Answer missing\" md\"\"\" 3. To what values are W and G tending to go? Was the system with the initial values for W and G and no outflow in equilibrium? Explain. \"\"\" md\" Answer missing\" "},{"url":"exercises/sde_model_aging/","title":"2. SDE aging","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"12\" title \"2. SDE aging\" date \"2025 02 07\" tags \"exercises\" description \"SDE aging\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using Catalyst using DifferentialEquations, Plots using Distributions md\"\"\" Exercise Aging and saturated repair \"\"\" md\"\"\" Aging is ultimately correlated with damaged cells. These damaged cells are called senescent cells . Senescent cells are cells that eventually stop multiplying but don't die off when they should. They instead remain and secrete factors that cause chronic inflammation and reduce regeneration, leading to disease and decline . Let X denote the number of senescent cells or the damage in a human body. Research shows that they are produced at a rate proportional to age . Fortunately, in living organisms, these senescent cells are removed by so called natural killer cells . However, like many biological processen, this biological process of removing senescent cells is saturated . Hence, the model that we could adopt in order to predict the number of senescent cells or damaged cells X in a human body, has two features 1. production of damage that rises linearly with age , and 2. the saturating removal of damage . A possible model is the following differential equation \\cfrac dX dt \\mu t \\beta \\cfrac X X \\kappa Lets denote X in trillions tn . The term \\mu t stands for the procution of senescent cells, and the term \\beta \\cfrac X X \\kappa for the removal of senescent cells. The time t is in years y . The coefficient \\eta tn y^2 is a proportionality factor for the production, \\beta tn y is the removal rate coefficient and \\cfrac X X \\kappa is the corresponding saturation factor, with \\kappa tn the amount of X at which they inhibit half of their own removal rate. If this model was all there was, then all individuals would age at the same rate and die at the same age. The model does not explain why genetically identical organisms could differ in the number of senenscent cells. Therefore, we will introduce noise in the model by treating it as a Stochastic Differential Equation SDE model, where noise will be added to both, production and removal processes. \"\"\" md\"\"\" Implementation of the system \"\"\" md\"\"\" Implement the above ODE into a reaction network object , and name it `senescent cells rn`. Take a default initial value X t 0 0.0 for the species X , and default values of \\mu 0.00558 , \\beta 0.4464 , \\kappa 1.116 for the parameters in the model. In addition to the parameters, take \\eta 0.1 as the default noise scaling factor, and, furthermore, set the noise scaling to 0.5 for the process exhibiting the saturating removal of damage. \"\"\" Uncomment and complete the instruction senescent cells rn reaction network begin species missing parameters missing default noise scaling missing missing missing end md\"\"\" Convert this reaction model into a symbolic differential equation model and verify that you get the correct differential equation as mentioned above. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" Setting initial condition, time span and parameters. \"\"\" md\"\"\" Initialize a vector `u0` with the default initial condition, set the timespan for the simulation we will simulate from 0\\ y to 120\\ y , and initialize a vector `param` with the default parameter values. In that way, later, you can change the initial condition and the parameter values if you want to try other values. \"\"\" u0 missing Uncomment and complete the instruction tspan missing Uncomment and complete the instruction parms missing Uncomment and complete the instruction md\"\"\" Simulating the system as an SDE problem \"\"\" md\"\"\" Create the SDE problem. \"\"\" sprob missing Uncomment and complete the instruction md\"\"\" Solve the SDE problem using `EM `as solver and time step `dt 0.1`. \"\"\" ssol missing Uncomment and complete the instruction md\"\"\" Plot the solutions. Use the option `ylim 0, 6 ` in order to limit the range of X . \"\"\" missing Uncomment and complete the instruction md\"\"\" Execute the cell, where the SDE problem is being solved, a few times and watch the stochastic changes in the solutions. \"\"\" md\"\"\" Simulating the system as an EnsembleProblem. \"\"\" md\"\"\" In order to see to have an idea of the extend of the stochastic effect on the solutions, we can make a so called EnsembleProblem . This allows us to plot many possible solutions in one plot. \"\"\" md\"\"\" Create an `EnsembleProblem` based on `sprob`. \"\"\" esprob missing Uncomment and complete the instruction md\"\"\" Solve the ensemble problem. Use `EM ` as solver, take a time step `dt 0.1`, use the options `save everystep true`, and `trajectories 100`. \"\"\" essol missing Uncomment and complete the instruction md\"\"\" Plot the solutions. Use the option `ylim 0, 6 ` in order to limit the range of X . \"\"\" missing Uncomment and complete the instruction md\"\"\" Distribution of ages at 5 trillion senescent cells \"\"\" md\"\"\" Set up a histogram that shows the distribution of ages once the 5 trillion senescent cells are present in the body. \"\"\" md\"\"\" hints The number of senescent cells of the `i` th trajoctory can be accessed with `essol.u i X `. The index of the first element in the `i` th trajectory that is greater than 5 can be found with `findfirst 5 , essol.u i X `. An index is a valid index when it if not `nothing`. The time at index position `j` can be accessed with `essol.u i .t j ` Appending an element, e.g., `x` to an array `times` can be done as follow `append times, x ` \"\"\" Uncomment and complete the instruction begin times make empty vector for missing for loop from 1 to 100, default step is 1 find index of first element that is greater than 5 missing if missing if index is a valid index missing append time to vector times end end end md\"\"\" Make a histogram with the array `times`. Use `bins range 0, 120, length 121 `. \"\"\" missing Uncomment and complete the instruction md\"\"\" Check the mean. \"\"\" missing Uncomment and complete the instruction md\"\"\" Check the standard deviation. \"\"\" missing Uncomment and complete the instruction md\"\"\" Check the minimum value. \"\"\" missing Uncomment and complete the instruction md\"\"\" Check the maximum value. \"\"\" missing Uncomment and complete the instruction md\"\"\" Interpret the results. Ask yourself the following question 1. Suppose that 5 trillion senescent cells is about the maximum a human body can bear. What is the approximate corresponding range of ages? \"\"\" md\" Answer missing\" md\"\"\" 2. What is the effect of halving the damage rate \\mu ? \"\"\" md\" Answer missing\" md\"\"\" 3. What is the effect of doubling the damage removal rate \\beta ? \"\"\" md\" Answer missing\" md\"\"\" 4. What is the effect of halving the noise? \"\"\" md\" Answer missing\" "},{"url":"exercises/sde_model_catalyst_intro/","title":"2. SDE catalyst intro","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"11\" title \"2. SDE catalyst intro\" date \"2025 02 07\" tags \"exercises\" description \"SDE catalyst intro\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using PlutoUI TableOfContents using Catalyst using DifferentialEquations, Plots md\"\"\" Solving SDE problems with Catalyst \"\"\" md\"\"\" Stochastic Differential Equations SDEs are mathematical equations used to model systems influenced by random noise. They extend Ordinary Differential Equations ODEs by incorporating terms that represent stochastic processes , typically in the form of a Wiener process or Brownian motion. SDEs are widely used in various fields, such as physics, biology, finance, and engineering, to describe the evolution of systems under uncertainty or with inherent randomness. \"\"\" md\"\"\" We will illustrate the concepts of SDE problems using the infection model that was used to introduce the Catalyst package and how to solve it as an ODE problem.\\ In a previous notebook elaborated on the infection model in detail, hence, we will here limit ourselves to summarizing the variables, parameters and reactions . \"\"\" md\"\"\" Below we summarize the variables species \"\"\" md\"\"\" | Variable | Unit | Meaning | | | | | | ``S`` | persons | number of susceptible persons | | ``I`` | persons | number of infected persons | | ``D`` | persons | number of deceased persons | | ``R`` | persons | number of resistant persons | \"\"\" md\"\"\" Below we summarize the parameters \"\"\" md\"\"\" | Variable | Unit | Meaning | | | | | | ``\\alpha`` | ``\\frac persons contact `` | chances of getting infected after contact | | ``\\beta`` | ``\\frac contact persons^2\\,day `` | contact rate | | ``r`` | ``\\frac 1 day `` | rate of leaving infection period | | ``m`` | ``\\frac person person `` | fraction of persons deceasing | | ``1 m`` | ``\\frac person person `` | fraction of persons becoming resistant | \"\"\" md\"\"\" Hence, the infection rate is ``\\alpha \\beta``. This means that a susceptible person meets an infected person ``S I``, this will result in ``2I`` at a rate ``\\alpha \\beta``. Futhermore, an infected person ``I`` will either become a deceased person ``D`` at a rate ``m r`` or become a resistant person ``R`` at rate `` 1 m r`` \"\"\" md\"\"\" Our infection model has three reaction events Infection, where a susceptible persons meets an infected persons and also becomes infected. Deceasing, where an infected person die. Recovery, where an infected person recovers and becomes resistant. \"\"\" md\"\"\" Each reaction is also associated with a specific rate ``\\alpha \\beta``, the infection rate. ``m r``, the death rate. `` 1 m r``, the recovery rate. \"\"\" md\"\"\" Hence, the following infection reactions are S I \\xrightarrow \\alpha \\beta 2I I \\xrightarrow mr D I \\xrightarrow 1 m r R \"\"\" md\"\"\" We are going to implement this system of reactions using Catalyst. \"\"\" md\"\"\" We first load the Catalyst package, which is required for the code in this introduction to run \"\"\" md\"\"\" Implementation of the system The following code creates a so called reaction network object , that we have named `infection sde model`, that implements the aforementioned reactions .\\ \"\"\" infection sde model reaction network begin parameters η 40 default noise scaling η α β, S I 2I, noise scaling 60.0 r m, I D r 1 m , I R end md\"\"\" Note that we have now introducted a new parameter cf. ` parameters η` and ` default noise scaling η` . This parameter represent a default noise scaling parameter applying to all reactions default value is 1 . You can overwrite this default value for specific reactions by specifying ` noise scaling ... ` on the same line.\\ They are in principle not necessary to solve the problem as a SDE problem but they can in many cases be very useful see later .\\ When solving SDE problems, some random noise will be introduced upon the reaction rates of all reactions. \"\"\" md\"\"\" Similarity as before, you can get a list of the reaction species with the function `species`, and a list of the parameters with the function `parameters`. \"\"\" parameters infection sde model md\"\"\" Note that the parameter \\eta also is present in the list. \"\"\" md\"\"\" This reaction model can of course also be converted to a symbolic differential equation model \"\"\" osys convert ODESystem, infection sde model md\"\"\" Simulating the system as an SDE problem We first need to load the Differential and Plot package, which is required for simulating the system and plotting the results. \"\"\" md\"\"\" Assume, as before, that there are 10\\,000\\,000 people in the country, and that initially 1\\,000 person are infected. Hence, I 0 1\\,000 , S 0 10\\,000\\,000 I 0 9\\,999\\,000 , D 0 0 and R 0 0 .\\ Furthermore, we take the following values for the parameters \\alpha 0.08\\ person contact , \\beta 10^ 6 \\ contact person^2\\,day , r 0.2\\ day^ 1 and m 0.4 .\\ Finally, we want to run our simulation from day 0 till day 90 . \"\"\" md\"\"\" Setting initial conditions \"\"\" u0 S 9 999 000.0, I 1 000.0, D 0.0, R 0.0 md\"\"\" Setting the timespan \"\"\" tspan 0.0, 90.0 md\"\"\" Setting parameter values In the parameter list, you could also mention another default value for the default noise scaling parameter. \"\"\" params α 0.08, β 1.0e 6, r 0.2, m 0.4, η 50 md\"\"\" Creating a SDEProblem Create the SDE problem. \"\"\" sprob SDEProblem infection sde model, u0, tspan, params md\"\"\" Solving the SDEProblem There are many solving methods available for solving SDE problems. You can find a list of methods here https docs.sciml.ai DiffEqDocs stable solvers sde solve Full List of Methods . We will simply use the first one in this list, namely `EM `, with the time step option `dt 0.1` that will introduce some randomness at every time step. \"\"\" ssol solve sprob, EM , dt 0.1 md\"\"\" Finally, we can plot the solution through the plot function. \"\"\" plot ssol md\"\"\" You might notice that is you run the above instruction `ssol solve sprob, EM , dt 0.1 ` subsequent times, you will each time get different solutions plots due to the randomness introduced by treating the problem as SDE problem. \"\"\" md\"\"\" Simulating the system as an EnsembleProblem. In order to see to have an idea of the extend of the stochastic effect on the solutions, we can create a so called EnsembleProblem . This allows us to plot many possible solutions in one plot. In order to create an EnsembleProblem , you need to create an SDEProblem first. Since we already have our SDEProblem called `sprob`, we can readily create an EnsembleProblem from this. All you need to do is call the function `EnsembleProblem` with `sprob` as argument. \"\"\" md\"\"\" Creating a EnsembleProblem Create the ensemble problem. \"\"\" esprob EnsembleProblem sprob md\"\"\" Solving the EnsembleProblem Solving the ensemble problem can be done with our, yet familiar, function `solve` as we did when solving the SDE problem, but now we need to provide a few more arguments. The first additional argument and value that we will provide is `save everystep true`, this will ensure that every simulation will be saved. The second argument indicates how many trajectories simulations you want to make. If you want an ensemble of 100 simulations, you can put `trajectories 100`. Hence, the function call would look like this `essol try solve esprob, EM , dt 0.1, save everystep true, trajectories 100 ` You can try this by uncommenting the instruction below and run the cell. \"\"\" essol try solve esprob, EM , dt 0.1, save everystep true, trajectories 100 md\"\"\" You will have noticed the detection of instabilities and the abortions. This is because of the stochastic effects that can cause calculations to become unstable. In order to cope with that, we will make sure that at every step the states S , I , R and D always remain within their boundaries. Here this is in the interval 0, 10000000 . To realize this we can create a so called `DisceteCallback` function using the functions below, namely, `condition` and `affect `. Both put in a `DisceteCallback` function they basically will make sure that at each integration step, the states cf. `integrator.u i ` will not go below 0 or above 10000000 . \"\"\" function condition u, t, integrator true end function affect integrator for i 1 4 if integrator.u i 10000000 integrator.u i 10000000 end if integrator.u i 0 integrator.u i 0 end end end md\"\"\" Combining them in a `DiscreteCallback` function \"\"\" cb DiscreteCallback condition, affect , save positions false,true md\"\"\" The option `save positions false,true ` serves to save only the states after the `affect ` function was called, and not the states before. \"\"\" md\"\"\" Now we can solve the ensemble problem while including the callback function. \"\"\" essol solve esprob, EM , dt 0.1, callback cb, save everystep true, trajectories 100 plot essol "},{"url":"exercises/sde_model_fermenter_secondorder/","title":"2. SDE fermentor 2nd order","tags":["exercises"],"text":" A Pluto.jl notebook v0.19.46 frontmatter order \"13\" title \"2. SDE fermentor 2nd order\" date \"2025 02 07\" tags \"exercises\" description \"SDE fermentor 2nd order\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using Catalyst using DifferentialEquations, Plots md\"\"\" Exercise Fermenter 2nd order kinetics SDE \"\"\" md\"\"\" In a fermenter reactor biomass grows on substrate. The reactor is fed with a inlet flow rate Q in L h , which consist of a manipulable input concentration of substrate S in g L . Inside the reactor, biomass, with a concentration of X g L , is produced through second order kinetics \\begin eqnarray %S \\xrightarrow \\quad\\quad \\beta Y \\, X S \\xrightarrow \\quad\\quad r Y \\, X \\quad\\quad\\quad\\quad r k \\, S\\,X \\end eqnarray with k L\\,gS^ 1 h^ 1 the reaction rate constant, and Y gX gS the yield coefficient which is defined here by the amount of produced biomass by consumption of one unit of substrate. Futhermore, the reactor is drained with an outlet flow Q L h , which consist of the current concentrations of substrate S g L and biomass X g L inside the reactor. The volume V L of the reactor content is kept constant by setting Q in Q . \"\"\" md\"\"\" Create a reaction network object model for the aforementioned problem in order to simulate the evolution of substrate S and biomass X with time as a Stochastic Differential Equation SDE problem with noise scaling. Name it `fermenter sde secondorder`. \"\"\" md\"\"\" Assign the following noise scaling values `η 0.10` for the main reaction default value for `η` noise scaling of `0.05` for the reaction describing the inlet S in noise scaling of `0.0` for the remaining reactions \"\"\" Uncomment and complete the instruction fermenter sde secondorder reaction network begin parameters missing missing missing missing end md\"\"\" Convert the system to a symbolic differential equation model and verify, by analyzing the differential equation, that your model is correctly implemented. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" Initialize a vector `u0` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction params missing Uncomment and complete the instruction sprob missing Uncomment and complete the instruction md\"\"\" Solve the SDE problem. Use `EM ` with `dt 0.1`. Store the solution in `ssol` \"\"\" ssol missing Uncomment and complete the instruction md\"\"\" Plot the results with the option `ylim 0.0, 2.0 ` \"\"\" missing md\"\"\" Create an `EnsembleProblem` in order to visualize a multiple solutions. Store it in `esprob`. \"\"\" esprob missing Uncomment and complete the instruction md\"\"\" Solve the `EnsembleProblem` using the same solver and time step as before, for 100 trajectories. Store the solution in `essol`. \"\"\" essol missing Uncomment and complete the instruction md\"\"\" Plot the results. Use as option again `ylim 0.0,2.0 ` and also `linealpha 0.5` to modify the line boldness. \"\"\" missing "},{"url":"exercises/ssa_model_catalyst_intro/","title":"2. SSA catalyst intro","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"14\" title \"2. SSA catalyst intro\" date \"2025 02 07\" tags \"exercises\" description \"SSA catalyst intro\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using PlutoUI TableOfContents using Catalyst using DifferentialEquations, Plots md\"\"\" Introduction to Catalyst SSA \"\"\" md\"\"\" Catalyst.jl is a symbolic modeling package for analysis and high performance simulation of chemical reaction networks. Catalyst defines symbolic ReactionSystems, which can be created programmatically or easily specified using Catalyst's domain specific language DSL . \"\"\" md\"\"\" This notebook describes the syntax for building chemical reaction network models using Catalyst's D omain S pecific L anguage DSL . We will illustrate this by implementing and solving an infection model by means of an SSA S tochastic S imulation A lgorithm . \"\"\" md\"\"\" The infection model revisited \"\"\" md\"\"\" For the sake of clarity we restate the describtion of the previous infection model. It is important to model the outbreak of infectious diseases in order to devise appropriate measures to avoid global epidemics. In this exercise we consider an isolated group of people in which a viral disease is spreading. An infection model similar to the SIR model but slightly extended will be used for this purpose. We are interested in the evolution of the number of susceptible S , infected I , deceased D and resistant R persons.\\ We make the following assumptions 1. Transmission of the disease from an infected person to a susceptible person takes place through direct contact. The chance of any two inhabitants of the group coming into contact with each other is \\beta , and the probability of infection after contact between an infected and a susceptible person is \\alpha . 2. Note that the above assumption implicitly states that the probability of two neighbours coming into contact with each other is as high as the probability of two people living at two extremes of the territory coming into contact with each other. 3. A pereson leaves the infection period at a rate r hence, a person is contagious for an average of 1 r days. Without appropriate medication, a fraction m of infected people die and a fraction 1 m of infected people acquire immunity after healing. 4. We assume that no one crosses the territory borders. \"\"\" md\"\"\" | Variable | Unit | Meaning | | | | | | ``S`` | persons | number of susceptible persons | | ``I`` | persons | number of infected persons | | ``D`` | persons | number of deceased persons | | ``R`` | persons | number of resistant persons | \"\"\" md\"\"\" | Variable | Unit | Meaning | | | | | | ``\\alpha`` | ``\\frac persons contact `` | chances of getting infected after contact | | ``\\beta`` | ``\\frac contact persons^2\\,day `` | contact rate | | ``r`` | ``\\frac 1 day `` | rate of leaving infection period | | ``m`` | ``\\frac person person `` | fraction of persons deceasing | | ``1 m`` | ``\\frac person person `` | fraction of persons becoming resistant | \"\"\" md\"\"\" Hence, the infection rate is ``\\alpha \\beta``. This means that a susceptible person meets an infected person ``S I``, this will result in ``2I`` at a rate ``\\alpha \\beta``. Futhermore, an infected person ``I`` will either become a deceased person ``D`` at a rate ``m r`` or become a resistant person ``R`` at rate `` 1 m r`` \"\"\" md\"\"\" Our infection model has three reaction events Infection, where a susceptible persons meets an infected persons and also becomes infected. Deceasing, where an infected person die. Recovery, where an infected person recovers. \"\"\" md\"\"\" Each reaction is also associated with a specific rate ``\\alpha \\beta``, the infection rate. ``m r``, the death rate. `` 1 m r``, the recovery rate. \"\"\" md\"\"\" Hence, the following infection reactions are S I \\xrightarrow \\alpha \\beta 2I I \\xrightarrow mr D I \\xrightarrow 1 m r R \"\"\" md\"\"\" We are going to implement this system of reactions using Catalyst. \"\"\" md\"\"\" We first load the Catalyst package, which is required for the code in this introduction to run \"\"\" md\"\"\" Implementation of the system First we create a reaction network object , that we have named `infection model`, that implements the aforementioned reactions . \"\"\" infection model reaction network begin α β, S I 2I r m, I D r 1 m , I R end md\"\"\" You can get a list of the different reaction species with the command `species` \"\"\" species infection model md\"\"\" The reaction model can be converted to a symbolic differential equation model via \"\"\" osys convert ODESystem, infection model md\"\"\" You can get a list of the differential equations with the command `equations` \"\"\" equations osys md\"\"\" To get a list of the state variables, you can use the command `unknowns` \"\"\" unknowns osys md\"\"\" To get a list of the parameters, you can use the command `parameters` \"\"\" parameters osys md\"\"\" Simulating the system as a Discrete Jump problem \"\"\" md\"\"\" We first need to load the Differential and Plot package, which is required for simulating the system and plotting the results. \"\"\" md\"\"\" Instead of simulating our model with the species defined as decimal numbers, we will simulate the individual reaction events through the so called Gillespie algorithm . This algorithm is a so called Stochastic Simulation Algorithm SSA .\\ The Gillespie algorithm is a computational method used to simulate discrete and stochastic random processes. The algorithm models the changes in a system over time by considering individual events and their probabilities, this allows to understand how random fluctuations affect the system's behavior. \"\"\" md\"\"\" To illustrate the simulation based on the Gillespie algorithm, we will use the same infection model as before, but considering much less individuals. Hence, we will use different initial conditions, parameter values and timespan as with the ODE problem. \"\"\" md\"\"\" Assume in this example that there are 50 people on the territory, and that initially 1 person is infected. Hence, I 0 1 , S 0 50 I 0 49 , D 0 0 and R 0 0 .\\ Furthermore, we take the following values for the parameters \\alpha 0.15\\ person contact , \\beta 0.1\\ contact person^2\\,day , r 0.2\\ day^ 1 i.e. a person is contagious for an average of 5\\ days and m 0.6 .\\ Finally, we want to run our simulation from day 0 till day 60 . \"\"\" md\"\"\" Setting initial conditions The vector holding the initial conditions for S , I , D and R is \"\"\" u0 S 49, I 1, D 0, R 0 md\"\"\" Setting parameter values The vector holding the parameter values for \\alpha , \\beta , r and m is \"\"\" params α 0.15, β 0.1, r 0.2, m 0.6 md\"\"\" Setting the timespan \"\"\" tspan 0.0, 60.0 md\"\"\" Creating an DiscreteProblem \"\"\" md\"\"\" Unlike the previous approach with ODEProblem denoting a deterministic ordinary differential equation , we wish to simulate our model as a jump process where each reaction event denotes a single jump in the state of the system . We do this by first creating a DiscreteProblem , and then using this as an input to a JumpProblem . \"\"\" md\"\"\" We create a DiscreteProblem by calling the `DiscreteProblem` function. Applying this function ensures that the problem is approached at a level of individual infections reactions . Hence, the variable values will be integers. Note that the order in which the input the model name, the initial condition, the timespan, and the parameter values is provided to `DiscreteProblem` matters Here, we save our DiscreteProblem in the `dprob` variable. \"\"\" dprob DiscreteProblem infection model, u0, tspan, params md\"\"\" Next, we create a so called JumpProblem by calling the `JumpProblem` function. Applying this function ensures that the infections reactions will happen stochastically. Note again that the order in which the input the model name, the DiscreteProblem variable, the simulation method is provided to `JumpProblem` matters The simulation method is denoted by the option `Direct `, which we recommend for now. \"\"\" jprob JumpProblem infection model, dprob, Direct md\"\"\" Solving the DiscreteProblem \"\"\" md\"\"\" Finally, we can simulate our model using the solve function, and plot the solution using the `plot` function. Here, the `solve` function also has a second argument `SSAStepper `, which we recommend for now. This is a time stepping algorithm that calls the `Direct` solver method to advance a simulation. \"\"\" dsol solve jprob, SSAStepper md\"\"\" Note that at the different time points the variables values in the solution are integer numbers and reflect the number of persons in either state S , I , D and R .\\ Futhermore, note that executing the `solve` command at different occasions will result in other solutions because of the stochastic character of the applied method. \"\"\" md\"\"\" Finally, we can plot the solution through the plot function. \"\"\" plot dsol md\"\"\" Below is a piece of code that solves the problem a 1000 times and stores the time values at which the number of infected persons becomes zero. \"\"\" begin times make empty vector while length times 1000 while statement dsol2 solve jprob, SSAStepper solve the problem j findfirst dsol2 I . 0 find index of first 0 if j nothing if index is a valid index append times, dsol2.t j append time to vector times end end end md\"\"\" The vector `times` is now filled with time values at which the number of infected persons becomes zero. \"\"\" times md\"\"\" With this vector we make a histogram so that you can have an idea of the distribution when the infected persons becomes zero. \"\"\" histogram times, bins range 0, 60, length 61 histogram times, bins range 0, 60, length 61 , normalize pdf "},{"url":"exercises/ssa_model_foxes_rabbits/","title":"2. SSA foxes rabbits","tags":["exercises"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"15\" title \"2. SSA foxes rabbits\" date \"2025 02 07\" tags \"exercises\" description \"SSA foxes rabbits\" layout \"layout.jlhtml\" frontmatter.author name \"Gauthier Vanhaelewyn\" using Markdown using InteractiveUtils begin add this cell if you want the notebook to use the environment from where the Pluto server is launched using Pkg Pkg.activate \".. .. pluto deployment environment\" end using Markdown using InteractiveUtils using Catalyst using DifferentialEquations, Plots using PlutoUI TableOfContents md\"\"\" Exercise foxes and rabbits An ODE and a discrete jump problem \"\"\" md\"\"\" Rabbits live on some secluded territory. Their maximum growth rate coefficient is r year^ 1 , and their population capacity is R m \\ rabbits . The rabbits die of old age or sickness with a dying rate coefficient d year^ 1 . At t 0 , foxes intrude the territory and stay there. The foxes exclusively feed themselves with the rabbits. They hunt the rabbits at a rate proportional to the number of foxes proportionality factor is h year^ 1 \\ foxes^ 1 . The population of foxes grows at a rate proportional to the number of rabbits proportionality factor is g year^ 1 \\ rabbits^ 1 . The foxes die of old age or sickness with a dying rate coefficient \\delta year^ 1 . The initial number of rabbits on the territory is 89, the initial number of foxes intruding the territory is 2. \"\"\" md\"\"\" Exercises 1. Make simulations of the evolution of rabbits and foxes as a ODE problem in the time interval 0, 10 \\ years . 2. Make simulations of the evolution of rabbits and foxes as a discrete jump problem in the time interval 0, 10 \\ years . Assume the following parameter values r 18.4\\ year^ 1 , R m 120\\ \\ rabbits , d 2.0\\ year^ 1 , h 1.4\\ year^ 1 \\ foxes ^ 1 , g 0.05\\ year^ 1 \\ rabbits ^ 1 and \\delta 1.0\\ year^ 1 . \"\"\" md\"\"\" Create a reaction network object model for the aforementioned problem. Name it `foxes rabbits rn`. Hints Use the variable names `R` and `F` for the rabbits and foxes respectively. Use the variable names `r`, `Rm`, `d`, `h`, `g` and `δ` for the parameters. \"\"\" Uncomment and complete the instruction foxes rabbits rn reaction network begin species missing parameters missing missing natural population growth of the rabbits missing deaths by age or sickness of the rabbits missing hunting of rabbits by the foxes missing gaining of foxes by hinting rabbits missing deaths by age or sickness of the foxes end md\"\"\" Convert the system to a symbolic differential equation model and verify, by analyzing the differential equation, that your model makes sense. \"\"\" osys missing Uncomment and complete the instruction md\"\"\" Initialize a vector `u0` with the initial conditions \"\"\" u0 missing Uncomment and complete the instruction md\"\"\" Set the timespan for the simulation \"\"\" tspan missing Uncomment and complete the instruction md\"\"\" Initialize a vector `params` with the parameter values \"\"\" params missing Uncomment and complete the instruction md\"\"\" Exercise 1 Solve the problem as an ODE problem. \"\"\" md\"\"\" Create the ODE problem and store it in `oprob` \"\"\" oprob missing Uncomment and complete the instruction md\"\"\" Solve the ODE problem. Use `Tsit5 ` and `saveat 0.05`. Store the solution in `osol` \"\"\" osol missing Uncomment and complete the instruction md\"\"\" Plot the solution. \"\"\" missing Uncomment and complete the instruction md\"\"\" Exercise 2 Solve the problem as a Discrete jump problem. \"\"\" md\"\"\" Create a DiscreteProblem and store it in `dprob` \"\"\" dprob missing Uncomment and complete the instruction md\"\"\" Create a JumpProblem and store it in `jdprob`. Use the simulation method `Direct `. \"\"\" jdprob missing Uncomment and complete the instruction md\"\"\" Solve the problem and store it in `jdsol`. Use the `SSAStepper ` stepping algorithm. \"\"\" jdsol missing Uncomment and complete the instruction md\"\"\" Plot the solution. \"\"\" missing Uncomment and complete the instruction md\"\"\" Solve the problem several times by running the cell which solves the problem and see what happens in the plot. \"\"\" md\"\"\" Think of your class of probability theory, why does the SSA model alsways lead to extinction? \"\"\" md\" Answer missing\" md\"\"\" Write a piece of code that solves the problem a 1000 times and stores the time values at which the rabbits die out. \"\"\" Uncomment and complete the instruction begin times make empty vector missing ... end md\"\"\" Make a histogram so that you can have an idea of the distribution when the rabbits die out. Use `bins range 0, 10, length 121 `. \"\"\" missing Uncomment and complete the instruction "},{"url":"homework/hw1/","title":"sample homework","tags":["module2","track_julia","track_material","homeworks","pluto","PlutoTeachingTools"],"text":" A Pluto.jl notebook v0.19.25 frontmatter homework number \"1\" order \"2.5\" title \"sample homework\" tags \"module2\", \"track julia\", \"track material\", \"homeworks\", \"pluto\", \"PlutoTeachingTools\" layout \"layout.jlhtml\" description \"sample howework\" using Markdown using InteractiveUtils using PlutoTeachingTools, PlutoUI md\"\"\" Sample Homework This notebook showcases some of the features of `PlutoTeachingTools.jl` https github.com JuliaPluto PlutoTeachingTools.jl and how to use these to write homework assignment in Pluto. \"\"\" tip md\"\"\"For a deeper tour of `PlutoTeachingTools.jl`, check their documentation https juliapluto.github.io PlutoTeachingTools.jl example.html \"\"\" md\"\"\" Useful functionalities `PlutoTeachingTools.jl` has some functions like `correct`, `still missing`, here a few demoes \"\"\" correct still missing keep working keep working md\"you can also give custom text to the boxes\" hint md\"this is a hint, hover the box to unblur the text\" md\"\"\" Exercise 1 a simple exercise Replace missing with the value `1`. \"\"\" x missing if ismissing x still missing elseif x 1 && x isa Int correct elseif x 1 && x isa Int b1 almost md\"\"\"Your variable has the right value, but it's not quite the right answer. Read carefully the instructions\"\"\" b2 hint md\"\"\"What type should the value of x be?\"\"\" md\"\"\" b1 b2 \"\"\" else keep working md\"\"\"That is not the right answer Keep trying \"\"\" end md\"\"\" here is a short demo of how it looks like when the student tries to solve the exercise \"\"\" Resource \"https user images.githubusercontent.com 49938764 249749643 8cc12de3 2b50 4182 b95d 686c2c18332c.mov\", width 500, autoplay \"\", loop \"\" md\"\"\" Exercise 2 Write a function called `myfun` that takes as input an integer and returns its square. Define a variable called `y` and assign `myfun 3 ` to it. \"\"\" let if isdefined myfun func not defined myfun else test values 1, 2, 3, 4, 5 msg1 correct for t in test values if myfun t t^2 msg1 keep working md\"Test failed for input t, expected t^2 , but got myfun t \" break end end msg1 end end if isdefined y var not defined y elseif y 9 correct else keep working md\"Evaluated expression y y is incorrect.\" end md\"\"\" and here is a quick demo of the exercise in action \"\"\" Resource \"https user images.githubusercontent.com 49938764 249748007 d0b2d773 6b21 49d4 89db ad737af510fe.mov\", width 500, autoplay \"\", loop \"\" "},{"url":"mod1_setup_website/basic_info/","title":"Fill course basic information","tags":["module1","track_setup","teaching","metadata"],"text":"Add basic informationIf you look at the homepage of the template website, you will see it has a bunch of placeholder text, such as “name of your course”, “a short catchy phrase” etc.To customize this, you will need to customize the metadata of the website. That is, add basic info for your class.To do so, you will need to fill the info in the files under the folder src/_data. Let us analyze these one by one.course_info.jlThis file contains a julia Dict with the basic info of the class. For each key (course_name, course_subtitle, etc.) replace the corresponding placeholder with an appropriate text for your class.When filling the institution_logo data with the name of your university logo file, do not forget to actually put the file under src/assets.Authors are listed as a vector of pairs, where the first element is the author name and the second is their homepage address. If you dont have a homepage address for the author, put an empty string \"\".homepage.jlThis file contains metadata for the info displayed in the homepage, particularlytitle: the title displayed on top of the homepagedisclaimer: the disclaimer displayed below the title. If you don’t want a disclaimer, you can remove this entry.highlights: in this entry you can specify the highlights of your class, which will be displayed on the homepage. This entry should be a vector of highlights. Each entry in the vector should be a dict with the following fields\nname: the title of the highlighttext: short description of the highlightimg: link to an image summarizing the highlightsidebar.jlIn this file you can specify the sidebar of the website. All lecture materials will be grouped in modules in the sidebar, which are defined in this file.The modules in the file are specified as a vector of pairs, in the formmodule_id => module_title\nfor example\"module1\" => \"Week 1: Introduction to the class\"\nTo link a file to a module, you will need to add the module identifier in the page tags. For more info about this, see Add frontmattertracks.jlIn this file you will specify tracks. Tracks can be used to group lectures across modules, e.g. if they have a commmon theme. When a track is selected on the sidebar, only the pages\nbelonging to that track will be highlighted.Similar to modules, tracks are stored in a vector of pairs in the formtrack_id => track_title\nfor example\"julia\" => \"💻 Julia programming\"\nTo link a file to a track, you will need to add the track id, prefixed with track_, to the tags of the page. For example, to add a lesson to the julia track defined above, you would add the tag track_julia to the tags of that lesson file.LicenseChoosing an appropriate license is important to make your material properly reusable.For text, popular licenses are Creative Commons, for example CC BY-SA 4.0For code, an OSI open source license is recommended. For example MIT or Apache 2.0 license.To add the license, open the file LICENSE.md and replace the text<insert license for your material judge>\nwith your license(s)."},{"url":"mod1_setup_website/getting_started/","title":"Getting started","tags":["module1","track_setup","teaching","repository structure"],"text":"Fork the templateGo to the template repository and click Use this template on the top-right corner. This will fork the repository under your github profile.Folder structureLet us have a look at what this repository looks like. The most important folder, where you will be mainly working is src. Here you will place all your lecture materials. So let us take a closer look at this.Opening the src folder, you will see the following_data folder: here you will place metadata about your website (university name, class semester, define tracks, etc.), more on this in the next lesson._include: This folder contains the layout templates that are used to generate the final pages on your website. Unless you want to tweak the layout, you will not need to modify this.assets: in this folder you can place all attachements, such as your university logo and other pictures. The folder also contains the CSS and scripts used to render the website.That was for the “infrastructure part” of the website, the rest is content! To add new pages to your website, simply them under the src folder. You can group them in subfolders, as done in this template, but that is not a strict requirement.When downloading this template, you will get the following material:installation.md: this page contains instructions on how to install Julia and Pluto. If you find it useful, you may keep it as is, or edit to match your wanted installation instructions.cheatsheets.md: contains a list of julia related resources. Again, you can keep it or remove it.logistics.md: empty markdown page, where you can describe the logistics of your classindex.jlmd: this is used to render the homepage. Do not remove or modify this!search.md: this is used to render the search tab on the sidebar, do not modify or remove this file.The remaining foldersmod1_setup_websitemod2_add_materialmod3_publish_websitehomeworkare placeholder samples, used to showcase what a deployed website looks like. As a bonus, these placeholder files actually document how to use this template.  You can read it and see what the final result looks like on the template webpage.When starting adding your course material, you will most likely want to remove these."},{"url":"mod1_setup_website/working_locally/","title":"Working locally","tags":["module1","track_setup","track_julia","PlutoSliderServer","pluto"],"text":"Working locallyOpen this repository in VS Code, and install the recommended extensions.To start running the development server, open the VS Code command palette (press Cmd+Shift+P), and search for Tasks: Run Task, then PlutoPages: run development server. The first run can take some time, as it builds up the notebook outputs cache. Leave it running.This will start two things in parallel: the PlutoPages.jl notebook (which generates the website), and a static file server (with Deno_jll). It will open two tabs in your browser: one is the generation dashboard (PlutoPages), the other is the current site preview (Deno_jll).Whenever you edit a file, PlutoPages will automatically regenerate! Refresh your browser tab. If it does not pick up the change, go to the generation dashboard and click the “Read input files again” button.Note!: This workflow is recommended for writing static content, styles, and for site maintenance. But for writing Pluto notebooks, it’s best to prepare the notebook first, and then run the site (because it re-runs the entire notebook on any change)."},{"url":"mod2_add_material/add_markdown/","title":"Add markdown files","tags":["module2","track_material","markdown","frontmatter"],"text":"Add markdown filesIf your lecture does not need to run code or use interactivity. You can write it as a markdown file.As an extra twist, you can evaluate julia code inside a $ symbol. For example,$(1 + 1)\nwill become2Add Front-matterFor each file, markdown or pluto, you will need to add a front-matter, which specifies the page metadata. For markdown files, the front-matter is specified at the top of the file between three dashes ---. For example, the front-matter of this file is---\ntitle: \"Add markdown file\"\norder: 1\nchapter: 2\nsection: 1\nlayout: \"md.jlmd\"\ntags: [\"module2\", \"track_material\", \"markdown\", \"frontmatter\"]\n---\nYou will need to specify the following attributestitle: title of the pageorder: the position of the page in the module on the sidebar. Hint!: You can also use fractional numbers, e.g. 1.5. This can be handy for homeworks, so you can include the homework between the first and second lesson without messing up lessons counting.layout: set to \"md.jlmd\", unless you are using some custom layoutchapter and section (optional): used to number the page. If for example chapter=1 and section=2, the page will be displayed as 1.2 on the sidebar and page header.image (optional): link to summarizing image to display in the subjects section on the homepage. If left empty, the page wont be included in the subjects section. If no page has an image field in the front-matter, the subjects section is not displayed.description (optional): short description of the notebookyoutube_id (optional): youtube id of the video associated with the page. If included, the page header will embed the youtube video.homework_number: needed only for homeworks, the number of the homeworktags: list of keywords for the page. It should at least include the module name, as defined in _data/sidebar.jl to include the page in the sidebar. You can also associate pages to a given track by adding the track id, prefixed with track_ to the tags. For example, if you want to include the page in the julia track, add track_julia in the tags list.Markdown 101If you are not familiar with markdown, you can see for example here. Here is a quick and dirty cheatsheetUse # for headers, for example# Header\n## Subheader\n### Sub-sub-header\nYou can create links with the syntax[text](adddress)\nFor example the link to the mardown tutorial above was typed as[here](https://www.markdowntutorial.com/)\nYou can insert pictures with the syntax![optional alternative text](link-to-picture)\nfor example![](https://raw.githubusercontent.com/JuliaLang/julia-logo-graphics/master/images/julia-logo-color.png)\nwill give"},{"url":"mod2_add_material/add_pluto/","title":"Add Pluto notebooks","tags":["module2","track_julia","track_material","Pluto","PlutoUI"],"text":" A Pluto.jl notebook v0.19.25 frontmatter chapter 2 section 2 order 2 image \"https raw.githubusercontent.com fonsp Pluto.jl 580ab811f13d565cc81ebfa70ed36c84b125f55d demo plutodemo.gif\" title \"Add Pluto notebooks\" tags \"module2\", \"track julia\", \"track material\", \"Pluto\", \"PlutoUI\" layout \"layout.jlhtml\" using Markdown using InteractiveUtils using PlutoTeachingTools, PlutoUI TableOfContents md\"\"\" Add Pluto notebooks Pluto.jl https plutojl.org is a revolutionary text editor for reactive and interactive programming. To start creating a Pluto notebook, open a terminal and launch Julia, then do ```julia using Pluto Pluto.run ``` This will launch a Pluto session, where you can write your notebook. To add the front matter, you can use Plut FrontmatterGUI, as the following short video clip shows. danger md\"For pluto notebooks, you will need to set layout to layout.jlhtml\" \"\"\" html\"\"\" video controls \"controls\" width \"800\" height \"600\" name \"Video Name\" source src \"https user images.githubusercontent.com 6933510 207080363 b912d591 f6f6 4522 a6fe 701e5ab04f0b.mov\" video \"\"\" md\"\"\" Pluto 101 Pluto is a notebook for Julia It is reactive , lightweight and has powerful interactivity tools . This will allow you to make your lesson material more engaging for students. Here are a few highlights of Pluto. tip md\" To learn more, check out Pluto featured notebooks https featured.plutojl.org , the JuliaCon video at the beginning of this notebook, or the presentations at PlutoCon 2021 https www.youtube.com playlist?list PLP8iPy9hna6T5sNOTeGdiqygHe 09geEW .\" Writing code in Pluto In Pluto code is written in cells, to add some code, simply create a new cell and type in. Each cell should contain 1 julia expression function definition, if statement, variable assignment, etc. . ```julia if rand 0.5 \"hi\" else \"there\" end ``` or ```julia a 1 ``` or ```julia function f return rand ^ 2 end ``` However , multiple expressions in the same cell are not allowed, for example ```julia a 1 b 2 a b ``` cannot be written in the same cell. You have two alternatives 1. Split it into multiple cells recommended to make reactivity better . 2. Wrap your staments inside a `begin ... end` or `let ... end` block. The difference is that the latter introduces a local scope, hence variables defined inside `let` are not visibles from outside. Reactivity Pluto is reactive This means that if you define a variable `a` in a cell, when you edit the variable value, all cells depending on that variable are automatically re evaluated. A few notes 1. As mentioned above, better to have a single variable assignment per cell, this will make the dependency graph slimmer and reactivity smoother. 2. Code modifying a given variable should be in the same cell, i.e. you cannot have two cells modifying the same variable. Here is a summarizing demo \"\"\" Resource \"https raw.githubusercontent.com fonsp Pluto.jl 580ab811f13d565cc81ebfa70ed36c84b125f55d demo plutodemo.gif\", width 350 md\"\"\" Built in environment Pluto is designed with reproducibility in mind To use packages registered in the Julia general registry, just type `using MyPackage` in some cells, as done at the beginning of this notebook. Pluto will automatically download the package The `Project.toml` and `Manifest.toml` what Julia uses to record all libraries, their versions and dependencies are stored inside the notebook, making it fully batteries included Resource \"https user images.githubusercontent.com 6933510 134823403 fbb79d7f dd3e 4712 b5d5 b48ad0770f13.gif\", width 400 \"\"\" md\"\"\" Interactivity Pluto has great support to make your notebooks interactive It allows you to associate variables with sliders and buttons that you can use to interactively change the result of the code. https user images.githubusercontent.com 6933510 136196607 16207911 53be 4abb b90e d46c946e6aaf.gif The easiest way to harness the power of Pluto interactivity is to use PlutoUI.jl https github.com juliapluto PlutoUI.jl , which is showcased in the next lecture https juliapluto.github.io mod2 add material plutoui showcase . \"\"\" "},{"url":"mod2_add_material/plutoui_showcase/","title":"PlutoUI showcase","tags":["module2","track_julia","track_material","Pluto","PlutoUI","interactivity"],"text":" A Pluto.jl notebook v0.19.25 frontmatter chapter \"2\" image \"https user images.githubusercontent.com 6933510 174067690 50c8128d 748b 4f50 8a76 2ce18166642b.png\" order \"3\" section \"3\" title \"PlutoUI showcase\" tags \"module2\", \"track julia\", \"track material\", \"Pluto\", \"PlutoUI\", \"interactivity\" layout \"layout.jlhtml\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end end using PlutoUI md\"\"\" PlutoUI.jl Pluto notebooks can use ` bind` to add interactivity to your notebook. It's a simple concept it uses the same reactivity that you have when editing code, except now you use sliders and buttons, instead of editing code. This notebook showcases some features of `PlutoUI.jl` , which allows you to easily add interactivity to your notebooks. This notebook is from Pluto featured notebooks https featured.plutojl.org , make sure to also check the others to learn more cool Pluto tricks \"\"\" md\"\"\" To use it in other notebooks Simply import the `PlutoUI` package, and Pluto's built in package manager takes care of the rest \"\"\" TableOfContents This is all you need to get a nice table of content md\"\"\" Basics \"\"\" md\" Slider\" bind x Slider 5 15 x md\"The first argument is a `Vector` or range. You can set the default value using a keyword argument \" bind y Slider 20 0.1 30, default 25 y md\"\"\" Scrubbable `Scrubbable` makes a number interactive, you can click and drag its value left or right. Try it in the text below \"\"\" md\"\"\" If Alice has bind a Scrubbable 20 apples, and she gives bind b Scrubbable 3 apples to Bob... \"\"\" md\"\"\" ...then Alice has a b apples left. \"\"\" md\"\"\" Use the Live Docs to learn more about `Scrubbable` \"\"\" md\" NumberField A `NumberField` can be used just like a `Slider`, it just looks different \" bind x different NumberField 0 100, default 20 md\" CheckBox\" bind z CheckBox z md\"Default value \" bind having fun CheckBox default true having fun having fun ? md\"🎈🎈\" md\"☕\" md\" TextField\" bind s TextField s md\"With a default value \" bind sentence TextField default \"te dansen omdat men leeft\" sentence md\"You can also create a multi line text box \" bind poem TextField 30, 3 , \"Je opent en sluit je armen,\\nMaar houdt niets vast.\\nHet is net zwemmen\" poem by Sanne de Kroon split poem, \"\\n\" md\" Select\" bind vegetable Select \"potato\", \"carrot\" vegetable bind favourite function Select sin, cos, tan, sqrt favourite function 2 md\"Instead of an array of values, you can also give an array of pairs , where the first item is the bound value, and the second item is displayed. \" bind fruit Select \"apple\" \"🍎\", \"melon\" \"🍉\" fruit md\"\"\" MultiSelect This widget allows the user to select multiple element by holding `Ctrl` `Cmd` while clicking a more items. \"\"\" bind vegetable basket MultiSelect \"potato\", \"carrot\", \"boerenkool\" vegetable basket md\"Just like `Select`, you can also give an array of pairs.\" md\"\"\" MultiCheckBox This widget allows the user to select multiple elements using checkboxes. \"\"\" bind fruit basket MultiCheckBox \"apple\", \"blueberry\", \"mango\" fruit basket md\"\"\" You can use `MultiSelect` and `MultiCheckBox` with any vector of objects, not just strings \"\"\" bind my functions MultiCheckBox sin, cos, tan f π for f in my functions md\"Just like `Select`, you can also give an array of pairs. See the Live Docs for `MultiCheckBox` for all the customization options \" md\" Button\" bind clicked Button \"Hello world\" clicked md\"\"\" Button as reactive trigger In the example above, any cell that references `clicked` will re evaluate when you click the button. This means that you can a button as a reactive trigger , by referencing its value in another cell. \"\"\" bind go Button \"Recompute\" let go md\"I am rand 1 15 years old \" end md\" FilePicker\" bind important document FilePicker important document md\"The file picker is useful if you want to show off your notebook on a dataset or image uploaded by the reader . It will work anywhere you don't access files using their path. The caveat is that large files might take a long time to get processed everything needs to pass through the browser. If you are using large datasets, a better option is to use `Select` to let the reader pick a filename. You can then read the file using `Base.read filename, type `\" md\" Extras\" md\" Clock\" bind t Clock t md\"You can set the interval `5.0` seconds , and disable the UI `true` \" bind t slow Clock 5.0, true t slow md\"You can use a `Clock` to drive an animation Or use it to repeat the same command at an interval just like with `Button`, you can reference a bound reactive variable without actually using it \" md\" DownloadButton\" md\"\"\" The download button is not an input element that you can ` bind` to, it's an output that you can use to get processed data from your notebook easily. The second argument is the output filename . \"\"\" DownloadButton poem, \"poem.txt\" DownloadButton 0x01, 0x02, 0x03 , \"secret data.bin\" md\"\"\" High level inputs \"\"\" md\"\"\" Confirm Normally, when you move a `Slider` ref or type in a `TextField` ref , all intermediate values are sent back to ` bind`. By wrapping an input element in `confirm`, you get a button to manually control when the value is sent , intermediate updates are hidden from Pluto. \"\"\" bind distance confirm Slider 1 100 distance md\"\"\" `confirm` can be wrapper around any input element to create a new one, including inputs from other packages, or inputs that you have made yourself \"\"\" md\"\"\" Combine This next high level component is a bit tricky, but very powerful Using `combine`, you can create a single input out of multiple existing ones In the example below, we create a new input, `wind speed input` . Notice that the list of wind directions is dynamic if you add a new direction, a 5th slider will appear \"\"\" import PlutoUI combine function wind speed input directions Vector return combine do Child inputs md\"\"\" name Child name, Slider 1 100 \"\"\" for name in directions md\"\"\" Wind speeds inputs \"\"\" end end bind speeds wind speed input \"North\", \"East\", \"South\", \"West\" speeds speeds.North md\"\"\" Use the Live Docs to learn more about `combine` and to see additional examples. 🙋 `combine` is very useful in combination with HypertextLiteral.jl https github.com MechanicalRabbit HypertextLiteral.jl , which you can learn using our JavaScript sample notebook. \"\"\" md\"\"\" Loading resources Notebooks use data from different places. For example, you use `Base.read` https docs.julialang.org en v1 base io network ~ text read filename%3A%3AAbstractString%2C%20String to access local data files inside your Julia code, and `Downloads.jl` https github.com JuliaLang Downloads.jl for remote data interwebs . `PlutoUI` helps you communicate with the person reading the notebook To get remote media URL inside your Markdown text , use `PlutoUI.Resource`. To get local media file inside your Markdown text , use `PlutoUI.LocalResource`. With media , we mean images , video and audio. We strongly recommend that you use remote media inside Pluto notebooks If your notebook uses local images, then those images will not show when someone else opens your notebook, unless they have the same images on their computer, at the exact same location. More on this later. \"\"\" md\"\"\" Resource If you just want to show images inside Markdown , you can use the built in syntax without `PlutoUI` ``` md\"Here is a dog https fonsp.com img doggoSmall.jpg \" ``` `PlutoUI.Resource` has some extra features specify image dimensions and spacing support for videos support for audio\"\"\" dog url \"https upload.wikimedia.org wikipedia commons thumb 1 15 Welsh Springer Spaniel.jpg 640px Welsh Springer Spaniel.jpg\" Resource dog url, width x x different t rex url \"https upload.wikimedia.org wikipedia commons transcoded 6 62 Meow.ogg Meow.ogg.mp3\" flower url \"https upload.wikimedia.org wikipedia commons 4 41 Sunflower Flower Opening Time Lapse.ogv\" md\"\"\"Hello I am a dog Resource dog url \"\"\" md\"\"\"And I sound like this Resource t rex url \"\"\" md\"\"\"This is my flower friend Resource flower url, width 200 \"\"\" md\" Attributes You can pass additional HTML attributes to `Resource`, these will be added to the element. For example \" md\"\"\" Resource dog url, width 20 Resource dog url, width 50 Resource dog url, width 100 Resource dog url, width 100, style \"filter grayscale 100% border 3px solid black \" \"\"\" Resource flower url, width 200, autoplay \"\", loop \"\" md\" YouTube, Vimeo, etc. If you use `Resource` for video, the URL has to point to a video file like `.mp4` or `.mov` . Popular video sites don't give you that link, instead, you can use their embed codes . You can find these inside the video player, by right clicking or using the menu buttons. You then use that inside an HTML block ``` html\\\"\\\"\\\" ~ paste embed code here ~ \\\"\\\"\\\" ``` You might need to change the `width` to `100%` to make it fit.\" html\"\"\" div style \"padding 56.25% 0 0 0 position relative \" iframe src \"https player.vimeo.com video 438210156\" style \"position absolute top 0 left 0 width 100% height 100% \" frameborder \"0\" allow \"autoplay fullscreen\" allowfullscreen iframe div script src \"https player.vimeo.com api player.js\" script \"\"\" md\" LocalResource not recommended The examples above use `Resource` to make media from a URL available inside Markdown. To use local files , simply replace `Resource` with `LocalResource` , and use a file path instead of a URL.\" html\" span style 'font family cursive color purple ' I really hope that this works span \" md\"\"\"Hello I am a dog LocalResource \"C \\\\Users\\\\fons\\\\Pictures\\\\hannes.jpg\" \"\"\" md\"\"\" html\" span style 'font family cursive color purple ' OOPS span \" , it didn't html\" br \" Here are two tips for getting local images to work correctly 1. Go to imgur.com https imgur.com and drag&drop the image to the page. Right click on the image, and select \"Copy image location\". You can now use the image like so ```PlutoUI.Resource \"https i.imgur.com SAzsMMA.jpg\" ``` 2. If your notebook is part of a git repository, place the image in the repository and use a relative path ```PlutoUI.LocalResource \".. images cat.jpg\" ``` \"\"\" md\" Why does it have to be so difficult? Pluto only stores code in the notebook file, not images. This minimal file format is very valuable, but it means that images need to be addressed , not stored. Addressing local files is fragile if someone else opens the notebook, or if you move the notebook to a different folder, that image file needs to be available at exactly the same path. This is difficult to do correctly, and if it works for you, it is hard to tell if it will work for someone else. Putting images online might be a hassle, but once it works, it will work everywhere The stateless nature of URLs means that the images will work regardless of how the notebook file is accessed, while keeping a minimal file format.\" md\" PlutoUI without Pluto Huh? Did you know that you can run Pluto notebooks without Pluto ? If your notebook is called `wow.jl`, then ```sh julia wow.jl ``` will run the notebook just fine. When you use ` bind`, your notebook can still run without Pluto Sort of. Normally, all bound variables are assigned the value `missing` when you run it elsewhere. However, the `PlutoUI` types have all been configured to assign a more sensible default value. For example, if your notebook contains ```julia bind x Slider 10 20 ``` and you run it without Pluto, then this statement simply assigns `x 10`. \" md\"`Pluto` and `PlutoUI` work independently of each other In fact, you could write a package with fun input elements, or add ` bind`able values to existing packages.\" md\" Appendix\" space html\" br br br \" space space space space space "},{"url":"mod3_publish_website/deploy_static/","title":"Deploy your website as static","tags":["module3","track_setup","deploy","netlify","github actions","github pages"],"text":"Deploying with github pagesDeploying your website as static page with github pages is a breeze.Whenever you push to main, the website will be deployed to a branch called gh-pages. All you need to do is go to your repository and from Settings > Pages choose to deploy from gh-pages branch, as the following picture shows.After that, the website will be available athttps://yourusername.github.io/your-repository-name\nNote that this is a static webpage, so sliders will not work. Students will still be able to play with interactivity by downloading the notebook or running it on binder.If you want interactivity to work on the webpage, you can eitherPrecompute the notebooks outputs (experimental)orRun your own server"},{"url":"mod3_publish_website/precompute_output/","title":"Precompute the pluto notebooks","tags":["module3","track_setup","track_julia","deploy","precompute","Pluto","PlutoSliderServer"],"text":"COMING SOON"},{"url":"mod3_publish_website/setup_server/","title":"Setup a server for your website","tags":["module3","track_setup","deploy","server","dynamic","droplet"],"text":"COMING SOON"},{"url":"project/project/","title":"Introduction","tags":["project"],"text":"main a img {\n    width: 5rem;\n    margin: 1rem;\n}\nProject assignmentModelling and Simulation of Biological SystemsAssignmentThis project aims to apply the principles of the course Modelling and Simulation to a small, self-contained example related to bioscience engineering. To this end, you can draw inspiration from one of our abstracts. You must work on your project in the Pluto notebook environment in the provided template (Dutch or English).Your project must be of a maximum length of eight to ten pages when printed. Your project contains the following:[ ] an abstract with context, why it is relevant, a summary of what you have done and a conclusion[ ] a model based on differential equations or a probabilistic model (a stochastic program)[ ] a clear outline of the variables and parameters[ ] it has some aspect of either process optimization (so you use optimization to improve a parameter, input or decision), calibration (you tweak a parameter based on sampling or optimization) or gains some deeper insight in the system (e.g., how inputs influence the output).[ ] you use some form of uncertainty assessment, sensitivity analysis or some other stochastic componentThese aspects can be extended or limited, as you choose. For example, you use your model for some process optimization via an optimizer but you can also tune a parameter by hand.You must submit the project as a PDF, HTML, and Julia (.jl) file through UFORA by 9 May.Each project should also end with a small attribution who did what parts according to the CRediT (Contribution Roles Taxonomy) classification. For example:MS: Conceptualization, Methodology, Writing – Review & Editing; BP: Software, visualization, Formal Analysis; DG: Writing – Original Draft Preparation.Rubric for gradingCategory0-1 Points (Unsatisfactory)2 Points (Developing)3 Points (Satisfactory)4 Points (Good)5 Points (Excellent)Clarity and Organization of NotebookNotebook is very difficult to follow. Code and explanations are disorganized or missing.Notebook has some organization, but it’s challenging to understand the logic and purpose.Notebook follows a generally clear structure with basic explanations of code and results.Notebook is well-organized, with clear sections and explanations that guide the reader’s understanding.Notebook is exceptionally well-structured, with detailed comments and explanations that make it effortless to follow the project’s logic.Quality of Mathematical ModelModel is irrelevant to the chosen biological phenomenon or has major conceptual flaws.Model shows some relevance to the problem but has significant simplifications or inaccuracies.Model accurately captures the essential aspects of the biological phenomenon.Model demonstrates good understanding of the system and includes relevant details and assumptions.Model is sophisticated and incorporates nuanced or insightful elements that reflect a deep understanding of the biological system.Quality of AnalysisAnalysis is absent or uses incorrect techniques. Results are not presented or interpreted.Analysis is attempted but flawed (errors, inappropriate methods). Results are presented with limited interpretation.Analysis uses appropriate techniques and produces mostly correct results with basic interpretation.Analysis employs suitable techniques leading to correct and meaningful results. Interpretation offers some insights.Analysis utilizes a range of techniques providing a comprehensive understanding of the model behavior. Interpretation offers significant insights and implications.Tips and adviceKeep it as simple as possible. A project exploring a small model with two or three variables, outlining a well-known concept from your courses can lead to excellent projects or marks.You can use generative AI tools to help you at any point of the project, from brainstorming the initial idea to writing and proofreading text to helping with the code. You still have to explain everything and make sure the text looks “natural”.Make sure you explain your reasoning well. Let others read it if it is clear how to do it.Make uninteresting or hard-to-understand pieces of code invisible if they don’t help the reader.You can use DifferentialEquations.jl or ModelingToolkit.jl if you want to build models that are beyond the scope of Catalyst.jl. For example, if you want to model a thermal process. However, this you personal choice, projects that use extra software will not be marked higher. It is perfectly possible to work out an exellent project using only the examples from the practical notes and theory course.We expect figures to be tidy (titles, labels and axis). See the example projects for how to do this.Use clear variable names and use comments (#) to annotate parts that are not clear.The programming can and should be minimal.Teaching staff will be available for feedback after the lectures and labs or at designated time slots.Keep it as simple as possible!"},{"url":"project/project_antibiotics/","title":"example antibiotics","tags":["project"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"3\" title \"example antibiotics\" date \"2025 02 07\" tags \"project\" description \"Project example antibiotics\" layout \"layout.jlhtml\" frontmatter.author name \"Michiel Stock\" using Markdown using InteractiveUtils This Pluto notebook uses bind for interactivity. When running this notebook outside of Pluto, the following 'mock version' of bind gives bound variables a default value instead of an error . macro bind def, element format off quote local iv try Base.loaded modules Base.PkgId Base.UUID \"6e696c72 6542 2067 7265 42206c756150\" , \"AbstractPlutoDingetjes\" .Bonds.initial value catch b missing end local el esc element global esc def Core.applicable Base.get, el ? Base.get el iv el el end format on end begin using Pkg Pkg.activate \".. .. pluto deployment environment\" make this cell invisible when you are finished title \"Modelling the effect of antibiotics on microbial resistence\" names \"Michiel\" academic year \"2023 2024\" email main person \"mail domain.be\" using PlutoUI interactivity using Plots plotting TableOfContents end using Catalyst, DifferentialEquations using SciMLSensitivity using ForwardDiff md\"\"\" title join names, \", \", \" and \" \"\"\" md\"\"\" Abstract The discovery of antibiotics is one of the greatest medical advancements of the 20th century. In this project, we use a simple ordinary differential equation ODE system to model the effect of antibiotic dosing on a system containing susceptible and resistant bacteria. Bacteria grow with a simple completion model susceptible bacteria grow faster due to the fitness cost associated with being resistant . Antibiotics can be added to the system. Higher concentrations kill bacteria more effectively, though antibiotics are quickly removed from the system. When choosing doses and dosing time, can we maximally reduce bacterial infection while limiting our total use? \"\"\" md\"\"\" Model In this system, we model three variables the number of susceptible S t and resistant R t bacteria and the concentration of antibiotics C t . The following processes take place the growth rate of the bacteria depends on their total density according to a logistic growth \\mu r 1 \\frac S R K . susceptible bacteria have a fitness cost of a , limiting their growth rate \\mu 1 a both S and R are removed according to a first order process with rate \\theta the antibiotic kills off bacteria according to a first order kinetics, with the rate determined by a Hill function. Resistant bacteria have twice as high K s . antibiotics leave the system degradation and removal with a rate of g . \"\"\" antibiotics reaction network begin species S t 500.0 R t 50.0 C t 0.0 r 1 S R K , S 2S growth susceptible bacteria r 1 S R K 1 a , R 2R growth resistant bacteria with fitness cost θ, S, R ∅ natural removal of the bacteria hill C, v, Ks, 4 , S ∅ killing S bacteria via antibiotics hill C, v, 2Ks, 4 , R ∅ killing R bacteria via antibiotics g, C ∅ removal of antibiotics end md\"These reactions form the following system of ordinary differential equations \" convert ODESystem, antibiotics parameters antibiotics md\" Simulation and analysis\" md\" One dose of antibiotics\" md\"We set some sensible parameter values \" pars r 2.7, K 1e3, θ 0.2, a 0.2, g log 2 , v 5.3, Ks 4. md\"We can simulate the system. Let us assume an initial concentration of antibiotics C 0 at t 0 and see what the effect is.\" tspan 0.0, 50.0 bind C0 Slider 0 100, show value true, default 20 oprob ODEProblem antibiotics, C C0 , tspan, pars plot solve oprob, RK4 md\"\"\" We note that When no antibiotic is present, the susceptible bacteria quickly take over. At low concentrations 2 20 , the resistant bacteria are killed off, while the resistant bacteria take temporarily over. High antibiotic concentrations 40 show nearly complete eradication of both types of bacteria. We note that after a while when all the antibiotics have left the system , the bacteria quickly return to total capacity. What if we give a second dose of antibiotic at a different time? \"\"\" md\" Second dose of antibiotics\" function dose integrator, D integrator C D end obprob2 ODEProblem antibiotics, , tspan, pars no AB in the system bind D Slider 1.0 100.0, show value true bind tdose Slider 1.0 35.0, show value true ps cb PresetTimeCallback tdose, I dose I, D begin plot solve oprob, callback ps cb vline tdose , label \"dosing time\", ls dash, title \"Second dosing with concentration of D at day tdose\" end md\"A strong second dose after about eight days can keep the population in check for a while. However, if we give a lower dose, the resistant bacteria will strongly dominate \" md\" Sensitivity analysis\" md\"We can explore the system further by performing a local sensitivity analysis. Let us explore two parameters the effectivity of the antibiotics given by parameter K s , the concentration where it at half its maximal effectivty and a , the fitness cost of the resistant bacteria. We only consider a single initial dose of antibiotics.\" begin tsteps 0 0.1 30 S Ks, a solve remake oprob, p Ks Ks, a a , RK4 , saveat tsteps S R Ks, a solve remake oprob, p Ks Ks, a a , RK4 , saveat tsteps R sens S Ks, a ForwardDiff.jacobian S, Ks, a sensitivity for susceptible bacteria sens R Ks, a ForwardDiff.jacobian R, Ks, a sensitivity for resistant bacteria end bind Ks Slider 1.0 1.0 20, show value true, default 4 bind a Slider 0 0.1 0.9, show value true, default 0.1 md\"Below is a simulation with the given parameters \" plot tsteps, S Ks, a R Ks, a , label \"S\" \"R\" , xlab \"t\", title \"Bacterial load with Ks Ks and a a\" md\"Next, we perform a sensitivity analysis for Ks and a, respectively.\" plot tsteps, sens S Ks, a ,1 sens R Ks, a ,1 , label \"S\" \"R\" , xlab \"t\", title \"Sensitivity for Ks\" md\"We see here that K s greatly positively impacts both types of bacteria shortly after the the antibiotics has been removed. The greater K s , the higher the antibiotics concentration needs to be to substantionally effect the bacterial density. The effect is the greatest for resistant bacteria. At longer time intervals, a small increase in K s give a positive effect on the susceptible bacteria and a negative effect on the resistant ones. Due to competition, this is a zero sum game and if the susceptible bacteria are less harmed, they can easier take back a large share of the system.\" plot tsteps, sens S Ks, a ,2 sens R Ks, a ,2 , label \"S\" \"R\" , xlab \"t\", title \"Sensitivity for a\" md\"Above, we see the effect of the fitness cost a , the decrease in growth rate the resistant bacteria show. Though the fitness cost only directly impacts the resistant bacteria, both are impacted due to competition. Just after the initial boom when the antibiotics have dissipated, there is a large negative local minimum for the resistant bacteria. After that, we see a strong negative effect for the resistant bacteria and, conversely, a positive effect for the susceptible ones.\" md\"\"\" Conclusion This toy model illustrates the effect of antibiotic treatment on a mixed population of susceptible and resistant bacteria. It highlights the importance of a sufficiently strong initial dose to prevent resistant bacteria from dominating the population. The model also demonstrates that the timing of a second dose can significantly influence the outcome, with a well timed second dose potentially keeping the bacterial population in check. However, this model is a simplification of real world scenarios. It assumes a simple first order removal of antibiotics, whereas actual pharmacokinetics involve absorption, distribution, metabolism, and excretion. Incorporating these factors would enhance the model's accuracy. Additionally, the model could be improved by including a more realistic immune response, capable of eliminating bacteria at low concentrations. Future work could also explore the effects of multiple doses or continuous antibiotic infusions, as well as the impact of stochastic fluctuations in bacterial growth and antibiotic effects. \"\"\" md\" Appendix\" "},{"url":"project/project_estrogen/","title":"example estrogen","tags":["project"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"5\" title \"example estrogen\" date \"2025 02 07\" tags \"project\" description \"Project example estrogen\" layout \"layout.jlhtml\" frontmatter.author name \"Michiel Stock\" using Markdown using InteractiveUtils begin using Pkg Pkg.activate \".. .. pluto deployment environment\" make this cell invisible when you are finished title \"Estrogen Estimation\" names \"Vo Orbeeld\", \"Pro Ject\" x 4 academic year \"202 x 202 x 1 \" email main person \"mail domain.be\" using PlutoUI interactivity using Random set seed using Turing sampling using StatsPlots plots TableOfContents end md\"\"\" title join names, \", \", \" and \" \"\"\" md\"\"\" Note This project is an adaption of the following blog post https www.oxinabox.net 2022 11 11 Estimating Estrogen.html by Dr. Frames Catherine White. Students are sadly not permitted to copy existing blog posts for their own projects. \"\"\" ╠═╡ begin using Pkg Pkg.activate \"..\" end ╠═╡ md\"\"\" Abstract \"\"\" md\"\"\" As a trans femme on HRT, I would like to know the concentrations of estradiol in my blood at all hours of day. This is useful as the peak, the trough and average all have effects. However, I only get blood tests a finite number of times per day – usually once. I am not a medical doctor, but I am the kind of doctor who can apply scientific modelling to the task of estimating curves based on limited observations. I am honestly surprised no one has done this. The intersection of trans folk and scientific computing is non trivial. After all, the hardest problem in computer science is gender dysphoria. \"\"\" md\"\"\" Model \"\"\" md\"\"\" In this blog post https web.archive.org web 20230128040153 http transascity.org sublingual versus oral estrogen on Sublingual versus Oral Estrogen they approximated the estradiol function with a linear to the peak then an exponential decay. c t \\begin cases \\frac c \\max t t \\max & \\text if t \\le t \\max\\\\ c \\max 2^ t t \\max t 1 2 & \\text if t \\max t\\,. \\end cases \"\"\" estrogen conc t, c max 100, t max 3, halflife 3 ifelse t t max, c max t max t, c max 2^ t t max halflife ╠═╡ function estrogen conc t, c max 100, t max 3, halflife 3 if t t max c c max t max t else c c max 2^ t t max halflife end return c end ╠═╡ plot estrogen conc, xlims 0, 24 , title \"Estrogen concentration model\", xlabel \"t h \", ylabel \"Estrogen concentration c pg ml \", legend nothing md\"\"\" The curve defines the current blood concentration of estradiol c at time t hours after application of the gel. It is described by 3 parameters `c max` the peak concentration. `t max` the time it takes to reach peak concentration. `halflife` the time it takes for the concentration to half after reaching peak. \"\"\" md\"\"\" It’s broadly biologically plausible. We expect a fast initial absorption, that should end at some point in few few hours. Since it is fast and short, it doesn’t really matter what we model it with, so linear is fine. Then we expect a tail off as it is consumed. It makes sense for the rate of absorption to be related to the quantity remaining – which suggests some exponential. We see this kind of thing very frequently in biological systems. This all might be nonsense, I am no systems biologist. \"\"\" md\"\"\" Calibration \"\"\" md\"\"\" Järvinen et al. 1997 give 3 curves for single dose. I am going to plot the data from Järvinen et al against curves using my formula, best fit by my own inspection. I am downshifting all the data from Järvinen et al by 25 pg mL, as that data was from post menopausal cis women, who produce about 25 pg mL of estradiol on their own before you take into account HRT. We only want to model the HRT component. \"\"\" md\" Visual inspection\" t obs 0, 1, 2, 3, 4, 6, 8, 10, 12, 16, 24 c obs 0, 25, 100, 132, 90, 82, 60, 55, 32, 15, 4 , 25, 35, 70, 75, 55, 45, 35, 32, 22, 15, 4 , 5, 14, 17, 20, 12, 10, 5, 2, 5, 5, 4 color palette RGB 91 255, 206 255, 250 255 RGB 245 255, 169 255, 184 255 RGB 1, 1, 1 custom colors for the occassion p data scatter t obs, c obs, color color palette, bg lightgray, label \"A200 obs\" \"A400 obs\" \"Amax obs\" , xlabel \"t h \", ylabel \"Estrogen concentration pg ml \" estimated funcs t estrogen conc t, 132, 3, 3.5 , t estrogen conc t, 100, 2.5, 3.5 , t estrogen conc t, 20, 3.5, 2.7 plot p data, estimated funcs, color color palette, label \"A200 pred\" \"A400 pred\" \"Amax pred\" md\"\"\" By looking at these plots, it seems a pretty decent model. Of course with enough degrees of freedom, you can fit an elephant. However, we have 10 points and only 3 degrees of freedom, of which we only varied 2 of them across the 3 datasets. So it seems like we are good. \"\"\" md\"\"\" Now I just fit those curves by eye. We can find the the most likely parameters via least squares regression. But really we are not after a single curve at all. We are interested in distributions over possible curves, given the observations. These tell use the possible realities that would explain what we are seeing. \"\"\" md\" Bayesian inference\" md\"\"\" To begin with lets think about our priors. These are our beliefs about the values the parameters might take before we look at the data. `c max` is somewhere between 0 and 500 pg mL ie. 0 1835 pmol L . If your E2 is above that something is very wrong. For now let’s not assume anything more and just go with a Uniform distribution. Though perhaps we could do something smarter hand select something that tailed off nicely towards the ends. `t max` is somewhere between 1 and 4 hours, we know this because the instruction say don’t let anyone touch you for the first hour so its definitely still absorbing then , and common wisdom is to not wash the area for at least 4 hours – so it must be done but then. If we use a Triangular distribution it has some push towards the center. `halflife`, we know this has to be positive, since otherwise it would not decay. Being log normal makes sense since it appears in an exponential. We would like it to have mode of 3.5 since that is what by eye we saw fit the curves all nicely probably bad Bayesian cheating here and because that means it is mostly all decayed by 24 hours – it can’t all that much higher usually since otherwise wouldn’t need daily doses, nor that much lower since in that case would need multiple doses per day. To set the mode to 3.5 we use `LogNormal log 3.5 1, 1 ` \"\"\" plot Uniform 0, 500 , TriangularDist 1, 4 , LogNormal log 3.5 1, 1 , legend false, linewidth 2, title \"c max\" \"t max\" \"halflife\" , layout 1, 3 md\"\"\" The other component we will want is an error term. We want to express our observations of the concentration as being noisy samples from a normal distribution centered on the actual curve we are estimating. So we need an error term which will allow some wiggle room about that curve, without throwing off the inference for the real parameters. We will define a variable called `err` which is the standard deviation of this error term. Our prior on this error term should be positive with a peak at 0 and rapidly tailing off. Gamma 1, 1 meets our requirement. \"\"\" plot Gamma 1,1 , title \"err\", legend false model function single dose t obs, c obs c max ~ Uniform 0, 500 t max ~ TriangularDist 1, 4 halflife ~ LogNormal log 3.5 1, 1 err ~ Gamma 1, 1 for i in eachindex t obs c pred estrogen conc t obs i , c max, t max, halflife c obs i ~ Normal c pred, err end end chain sample single dose t obs, c obs 1 , NUTS , 2000 plot chain md\"So let’s look at the distribution over curves as represented by samples .\" md\"\"\" We see this nice kinda clear and fairly small range of values for the parameters `c max`, `t max`, `halflife`. The error term, `err`, is quite large \"\"\" md\" Using less datapoints\" md\"\"\" Now that we have shown we can do inference to find distributions over parameters that fit the data let’s get on to a more realistic task. No one gets blood tests every few hours outside of an experimental data gathering exercise. The most frequent blood tests I have heard of is every 2 weeks, and most are more like every 3 6 months. So what we are really interested in is inferring what could be happening with blood levels from a single observation. \"\"\" chain 1 sample single dose 8 , 60 , NUTS , 2000 md\"\"\" So that’s actually really informative. There are a range of possible explanations. From a very small t max and a large c max meaning it peaked early and has tailed off a lot, to the more likely ones which look more like the kind of curves we were seeing based on the experimental data with more frequent measurements. \"\"\" md\"\"\" We can add more observation points and cut down the number of realities we might be in. This realistically is actually a practical thing to do. You can see in the following plots that if we add a reading of 60 at 8 hours after application we break the possible universes into two possible sets of explanations. One set where the 3 hour reading is while it is still rising, and one set where it is falling. \"\"\" chain 2 sample single dose 3, 8 , 100, 60 , NUTS , 2000 chain 3 sample single dose 1, 3, 8 , 50, 100, 60 , NUTS , 2000 md\"\"\" Conclusion \"\"\" md\"\"\" This is just a first look at this topic. I imagine I might return to it again in the future. Here are some extra things we might like to look at Determining optimal times to test 3 readings will not always capture the curve, different times may be more informative than others, especially when we consider the error level vs the signal level. Average levels the distribution of average level is likely fairly collapsed – multiple different sets of parameter values can lead to same average level. Multi day Since estrogen doesn’t hit zero at 24 hours can model across days. Can also include a term for variation in when it was applied in the day since people are not that consistent. Multiday is crucial for making the model realistic Dose changes extending beyond multiday, people change there does, and we know higher dose leads to higher levels so we can insert that prior knowledge. Probabilistic programming is a cool technique for working on pharmacodynamics. It lets us handle the fact that we have many unknowns about people’s individual biology, while still narrowing down a possible set of worlds they might live in. \"\"\" md\" Appendix\" function plot estrogen estimations chain, t obs, c obs c max, t max, halflife chain param for param in c max, t max, halflife est funcs t estrogen conc t, c max i , t max i , halflife i for i in eachindex c max plot est funcs, color color palette 2 , xlims 0, 25 , ylims 0, 200 , label nothing, opacity 0.01 scatter t obs, c obs, color color palette 1 , label nothing end plot estrogen estimations chain, t obs, c obs 1 plot estrogen estimations chain 1, 8 , 60 plot estrogen estimations chain 2, 3, 8 , 100, 60 plot estrogen estimations chain 3, 1, 3, 8 , 50, 100, 60 md\"\"\" References \"\"\" md\"\"\" Järvinen, A., Granander, M., Nykänen, S., Laine, T., Geurts, P., & Viitanen, A. 1997 . Steady‐state pharmacokinetics of oestradiol gel in post‐menopausal women effects of application area and washing. BJOG An International Journal of Obstetrics & Gynaecology, 104, 14 18. \"\"\" "},{"url":"project/project_ladybugs/","title":"example ladybugs","tags":["project"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"6\" title \"example ladybugs\" date \"2025 02 07\" tags \"project\" description \"Project example ladybugs\" layout \"layout.jlhtml\" frontmatter.author name \"Michiel Stock\" using Markdown using InteractiveUtils begin using Pkg Pkg.activate \".. .. pluto deployment environment\" make this cell invisible when you are finished title \"APHID ANNIHILATION 🤘🔥🔥\" names \"Vo Orbeeld\", \"Pro Ject\" x 4 academic year \"202 x 202 x 1 \" email main person \"mail domain.be\" using PlutoUI interactivity using Random set seed using Catalyst, JumpProcesses, OrdinaryDiffEq modeling using Optim using StatsPlots plots TableOfContents end md\"\"\" title join names, \", \", \" and \" \"\"\" md\"\"\" Abstract Belgium's native ladybugs, or lady beetles, have had it rough the last few decades. In 1995, the Asian lady beetle Harmonia axyridis was introduced in Belgium as a biological pest control agent, and quickly established itself as the new kingpin R.L. Koch, 2003 . While useful for controlling agricultural pests such as aphids, the beetle has been found to have a negative effect on biodiversity by outcompeting native ladybugs, essentially bullying the poor things Brown et al., 2008 . The goal of this project is to create a simple model for the dynamics of a ladybug population living off aphids and subsequently to use it to investigate what feeding strategy is optimal for the ladybugs. We then intend to help the native ladybugs by passing this information on to them. Since we are dealing with relatively small population sizes that can go to 0, we have chosen to model this system as a discrete stochastic jump process. We optimized the ladybug's aphid predation rate for an ideal deterministic case and then investigated whether how this optimal feeding rate performed in a stochastic environment. \"\"\" md\"\"\" Model \"\"\" md\"\"\" First we introduce our notations for the different components of the model. Variables 🦗 The aphid population size 🐞 The ladybug population size Parameters 🚩🦗 The environment's carrying capacity for aphids. 🍼🦗 The aphid's birth rate. 👌🦗 The aphid's target population level as designated by the ladybugs. 🍴🐞 The ladybug's aphid predation rate. This is the rate at which native ladybugs eat aphids. 💀🐞 The ladybug's mortality rate. We'll now introduce the model step by step in the following section. Let's start by defining the time span over which we'll simulate our model six months, equating about one growing season \"\"\" tspan 0.0, 6 30.0 md\"\"\" Aphids \"\"\" md\"\"\" We start with the aphids, which will serve as the ladybugs' food source. We will use a simple Gompertz model for their growth, as aphids are known for their explosive exponential population growth, yet their maximum population size is limited by how many aphids their host plant can feed. In reality aphids are of course able to switch host plants, but for simplicity's sake we will consider an aphid population with one single host plant which does not deteriorate . \"\"\" aphid rn reaction network begin parameters 🚩🦗 10 000 🍼🦗 0.1 species 🦗 t 1000 🍼🦗 🚩🦗 🦗 🚩🦗, 🦗 2🦗 end sol aph JumpInputs aphid rn, , tspan, | JumpProblem | solve plot sol aph, label \"Aphids\", palette okabe ito, title \"Evolution of an unbothered aphid population\", size 700, 400 , margin 3Plots.mm md\"\"\" Get eaten by ladybugs \"\"\" md\"\"\" Next we add the ladybugs. They eat aphids to make more ladybugs, and then die of old age after living a fulfilling ladybug life. We assume two ladybugs need to eat 30 aphids to produce a child. Additionally, the rate at which aphids get eaten scales linearly with the amount of ladybugs, but not the amount of aphids. This is because we assume the number of ladybugs will be the limiting factor 20 ladybugs will eat twice as many aphids as 10 ladybugs, but it does not matter whether 1000 or 2000 aphids are present we thus also assume the ladybugs have no difficulty finding the aphids . Finally, we also assume ladybugs will always leave a certain number of aphids alive lest their food source goes extinct. To model ladybug mortality, we also assume a first order process. The more ladybugs are present, the more ladybugs will die on any given day by reaching old age, or perhaps getting eaten by a bird. \"\"\" ladybug rn reaction network begin parameters 🚩🦗 10 000 🍼🦗 0.1 👌🦗 300 🍴🐞 0.3 💀🐞 0.1 species 🦗 t 1000 🐞 t 10 🍼🦗 🚩🦗 🦗 🚩🦗, 🦗 2🦗 🍴🐞 🐞 🦗 👌🦗 🦗, 2🐞 30🦗 3🐞 💀🐞, 🐞 0 end md\"\"\" Let's double check everything is in order \"\"\" convert ODESystem, ladybug rn sol bugged JumpInputs ladybug rn, , tspan, | JumpProblem | solve plot sol bugged, label \"Aphids\" \"Ladybugs\" , palette okabe ito, yaxis log, ylims 1, 1e4 , title \"Evolution of a very much bothered aphid population & ladybugs \", size 800, 500 , margin 3Plots.mm md\"\"\" And that's it for the structure of our ladybug model \"\"\" md\" Simulation and analysis\" md\"\"\" Optimisation of ladybug behaviour \"\"\" md\"\"\" Given our simple ladybug model, we'd like to find the optimal ladybug behaviour so that they have the largest possible population size at the end of the growing season. To this end we'll optimize a loss function that returns the negative ladybug population size at the end of the growing season maximize population size minimize the inverse in function of the aphid predation rate 🍴🐞 and the desired minimal aphid population level 👌🦗 the other 3 parameters are outside of the ladybugs' control \"\"\" md\"\"\" For the callibration process, we'll assume a perfectly deterministic system by modeling it as an ODE problem rather than a jump problem. This is because trying to optimize a strongly stochastic process is a pain and we'd rather not deal with that. \"\"\" ladyprob ODEProblem ladybug rn, , tspan, function ladybug loss params sol remake ladyprob, p 🍴🐞 params 1 , 👌🦗 params 2 | x solve x, reltol 1e 9, abstol 1e 9 set tolerance of the solver very low or the optimizer finds the right parameters to break it and make the aphid population go below 0 for even more ladybugs return sol 🐞 end end md\"\"\" We use constrained optimisation since both parameters must be positive. In addition, we set a minimum value of 100 for the aphids' target aphid population level. This is an estimation for how many aphids are needed to start a new population the next growing season. \"\"\" res optimize ladybug loss, 0, 100 , 1, Inf , 0.3, 300 , Fminbox NelderMead params opt 🍴🐞 res.minimizer 1 , 👌🦗 res.minimizer 2 remake ladyprob, p params opt | x solve x, reltol 1e 9, abstol 1e 9 | x plot x, yaxis log, ylims 1, 1e4 , label \"Aphids\" \"Ladybug\" , palette okabe ito, title \"Evolution of an optimally bothered aphid population & ladybugs \", size 800, 500 , margin 3Plots.mm md\"\"\" We can see that a lower predation rate allows for the aphid population to flourish while the ladybug population steadily rises, until the ladybug population reaches a critical size near the end of the growing season. At this point there are so many ladybugs the aphid population starts collapsing ending with a strong crash just at the end of the growing season. Patience seems to be the key \"\"\" md\"\"\" Uncertainty assessment of ladybug behaviour \"\"\" md\"\"\" We've found a set of optimal parameters for ladybug behaviour, but that was for a deterministic case. We now want to get an idea of whether these parameters will truly result in high population sizes when considering a more realistic stochastic scenario. To achieve this, we perform a simple grid search over different values of the aphid predation rate 🍴🐞 in the neighbourhood of the optimal value. We perform multiple runs per point to take into account the random nature of the outcome. We did not take the target aphid level 👌🦗 into account as quickly playing around with different values showed very little change in the output not shown for brevity . \"\"\" function ladybug performance 🍴🐞, jump prob sol remake jump prob, p 🍴🐞 🍴🐞, 👌🦗 res.minimizer 2 | solve return sol 🐞 end we're interested in the ladybug population level at the end of the growing season end begin Random.seed 1337 for reproducability num repeats 100 jump prob DiscreteProblem ladybug rn, , tspan, | x JumpProblem ladybug rn, x plot title \"Final ladybug population sizes in function of aphid predation rate\", xlabel \"Aphid predation rate\", ylabel \"Ladybug population size\", size 800, 500 , margin 3Plots.mm grid points 0.05 0.01 0.2 for grididx, 🍴🐞 in enumerate grid points performances ladybug performance 🍴🐞, jump prob for in 1 num repeats do a few simulations with the same value for 🍴🐞 boxplot grididx , performances, label false, outliers false, color orange end xticks 1 length grid points , string. grid points boxplots always have a width of 1, so we need to fidget with the x axis a little end md\"\"\" From this figure we can see that ladybugs with a predation rate that is too low 0.1 always go extinct by the end of the growing season, presumably because they die faster than they replenish the population. Around the optimal value we see a big peak in the expected and maximum final population sizes, steadily decreasing as the predation rate grows with what seems another local optimum near 0.16 . This confirms our previous finding that patient ladybugs will, on average, perform well with respect to their population size at the end of the growing season, though not quite as well as in a deterministic scenario. \"\"\" md\"\"\" Conclusion In our project we made a simple model for the dynamics of a ladybug predating on aphids. We then optimized the predation strategy of the ladybugs in a deterministic scenario and found that a patient predation strategy can be very rewarding. We then checked whether this was also true in a stochastic scenario, and found that it was indeed the case. Some following steps for this model would be to Validate whether it can approximate real aphid ladybug dynamics by trying to calibrate it on real data and change the model if required Introduce invasive ladybugs to the model and investigate their impact on the native ladybugs w.r.t. some of the model parameters \"\"\" md\" Appendix\" md\"\"\" References \"\"\" md\"\"\" Koch, R. L. 2003 . The multicolored Asian lady beetle, Harmonia axyridis a review of its biology, uses in biological control, and non target impacts. Journal of insect Science, 3 1 , 32. Brown, P. M. J., Adriaens, T., Bathon, H., Cuppen, J., Goldarazena, A., Hägg, T., ... & Roy, D. B. 2008 . Harmonia axyridis in Europe spread and distribution of a non native coccinellid. From biological control to invasion the ladybird Harmonia axyridis as a model species, 5 21. \"\"\" "},{"url":"project/project_template/","title":"template","tags":["project"],"text":" A Pluto.jl notebook v0.20.4 frontmatter order \"2\" title \"template\" date \"2025 02 07\" tags \"project\" description \"Project Template\" layout \"layout.jlhtml\" frontmatter.author name \"Michiel Stock\" using Markdown using InteractiveUtils begin using Pkg Pkg.activate \".. .. pluto deployment environment\" make this cell invisible when you are finished title \"Our super cool project\" names \"Alice\", \"Bob\", \"Carol\" academic year \"202x 202 x 1 \" email main person \"mail domain.be\" using PlutoUI interactivity using Plots plotting TableOfContents end md\"\"\" title join names, \", \", \" and \" \"\"\" md\"\"\" Abstract About 250 words about your project 1 2 sentence basic introduction to your topic, accessible to every bioengineering student 1 2 sentences bit more specialized introduction 1 2 sentences general goal of the project 2 3 sentences short overview of how you built the model and what analysis you did \"\"\" md\"\"\" Model general outline of the model variables parameters For example, the metabolic rate y as a function of the mass m of an organism follows a power law. \"\"\" metabolic rate y m a 0.75, C0 1 C0 m^a note that you likely will use a Catalyst model md\" Simulation and analysis\" md\"\"\" Explore your model \"\"\" plot y, 0.01, 1000, label \"metabolic rate\", xlab \"mass kg \" md\"\"\" Conclusion A short conclusion of your analysis with a relection on how you would improve this model. \"\"\" md\"\"\" Attribution one sentence about who did what mainly according to the CRediT https en.wikipedia.org wiki Contributor Roles Taxonomy Contribution Roles Taxonomy classification. \"\"\" md\" Appendix\" "},{"url":"welcome/errata/","title":"Errata","tags":["welcome"],"text":"main a img {\n    width: 5rem;\n    margin: 1rem;\n}\nNew errata?Have you found a spelling mistake, an error? Do you think there might be a typo somewhere? Let us know on the dedicated forum on Ufora!Errata overviewPlaceholder: errata will be listed here"},{"url":"welcome/installation/","title":"Software installation","tags":["welcome"],"text":"First-time setup: Install Julia & PlutoText and pictures version:Step 1: Install Julia 1.11.2Go to https://julialang.org/downloads and download the current stable release, Julia 1.11.2, using the correct version for your operating system (Linux x86, Mac, Windows, etc).Step 2: Run JuliaAfter installing, make sure that you can run Julia. On some systems, this means searching for the “Julia 1.11.2” program installed on your computer; in others, it means running the command julia in a terminal. Make sure that you can execute 1 + 1:Make sure that you are able to launch Julia and calculate 1+1 before proceeding!Step 3: Install PlutoNext we will install the Pluto, the notebook environment that we will be using during the course. Pluto is a Julia programming environment designed for interactivity and quick experiments.Open the Julia REPL. This is the command-line interface to Julia, similar to the previous screenshot.Here you type Julia commands, and when you press ENTER, it runs, and you see the result.To install Pluto, we want to run a package manager command. To switch from Julia mode to Pkg mode, type ] (closing square bracket) at the julia> prompt:\njulia> ]\n\n(@v1.11.2) pkg>\nThe line turns blue and the prompt changes to pkg>, telling you that you are now in package manager mode. This mode allows you to do operations on packages (also called libraries).To install Pluto, run the following (case sensitive) command to add (install) the package to your system by downloading it from the internet.\nYou should only need to do this once for each installation of Julia:\n(@v1.11.2) pkg> add Pluto\nThis might take a couple of minutes, so you can go get yourself a cup of tea!You can now close the terminal.Step 4: Use a modern browser: Mozilla Firefox or Google ChromeWe need a modern browser to view Pluto notebooks with. Firefox and Chrome work best.Second time: Running Pluto & opening a notebookRepeat the following steps whenever you want to work on a project or homework assignment.Step 1: Start PlutoStart the Julia REPL, like you did during the setup. In the REPL, type:julia> using Pluto\n\njulia> Pluto.run()\nThe terminal tells us to go to http://localhost:1234/ (or a similar URL). Let’s open Firefox or Chrome and type that into the address bar.If you’re curious about what a Pluto notebook looks like, have a look at the Featured Notebooks. These notebooks are useful for learning some basics of Julia programming.If you want to hear the story behind Pluto, have a look a the JuliaCon presentation.If nothing happens in the browser the first time, close Julia and try again. And please let us know!Step 2a: Opening a notebook from the webThis is the main menu - here you can create new notebooks, or open existing ones. Our homework assignments will always be based on a template notebook, available in this GitHub repository. To start from a template notebook on the web, you can paste the URL into the blue box and press ENTER.For example, homework 0 is available here. Go to this page, and on the top right, click on the button that says “Edit or run this notebook”. From these instructions, copy the notebook link, and paste it into the box. Press ENTER, and select OK in the confirmation box.The first thing we will want to do is to save the notebook somewhere on our own computer; see below.Step 2b: Opening an existing notebook fileWhen you launch Pluto for the second time, your recent notebooks will appear in the main menu. You can click on them to continue where you left off.If you want to run a local notebook file that you have not opened before, then you need to enter its full path into the blue box in the main menu. More on finding full paths in step 3.Step 3: Saving a notebookWe first need a folder to save our homework in. Open your file explorer and create one.Next, we need to know the absolute path of that folder. Here’s how you do that in Windows, MacOS and Ubuntu.For example, you might have:C:\\Users\\fons\\Documents\\18S191_assignments\\ on Windows/Users/fons/Documents/18S191_assignments/ on MacOS/home/fons/Documents/18S191_assignments/ on UbuntuNow that we know the absolute path, go back to your Pluto notebook, and at the top of the page, click on “Save notebook…”.This is where you type the new path+filename for your notebook:Click Choose.Step 4: Sharing a notebookAfter working on your notebook (your code is autosaved when you run it), you will find your notebook file in the folder we created in step 3. This the file that you can share with others, or submit as your homework assignment to Canvas.\nconst run = f => f();\nrun(async () => {\nconst versions = await (await fetch(`https://julialang-s3.julialang.org/bin/versions.json`)).json()\nconst sortby = v => v.split(\"-\")[0].split(\".\").map(parseFloat).reduce((a,b) => a*10000 + b)\nconst version_names = Object.keys(versions).sort((a,b) => sortby(a) - sortby(b)).reverse()\nconst stable = version_names.find(v => versions[v].stable)\nconsole.log({stable})\nconst pkg_stable = /\\d+\\.\\d+/.exec(stable)[0]\ndocument.querySelectorAll(\"auto-julia-version\").forEach(el => {\n    console.log(el)\n    el.innerText = el.getAttribute(\"short\") == null ? stable : pkg_stable\n})\n});"},{"url":"welcome/logistics/","title":"Class logistics","tags":["welcome"],"text":"main a img {\n    width: 5rem;\n    margin: 1rem;\n}\nin generalLook at Ufora for the latest announcements and practicalities.Course logisticsClasses will be held in A1.1 Tuesday at 1PMExercises in PC-lab E.-1.1 Monday mornings and Tuesday afternoon.Course notesThe MODSIM course notes in pdf format can be found as a download on Ufora or in the release notes on this GitHub repository.Course slidesThe MODSIM slides in pdf format can be found as a download on Ufora."}]